[
 {
  "REGULAR": "Lack of products and delay in delivery"
 },
 {
  "REGULAR": "uncompetitive pricing and product unavailability"
 },
 {
  "REGULAR": "Unfortunately, I can't give a bigger name because of its sales pipeline. Distribution, in my point of view, doesn't work to open customers, it just takes advantage of the opportunities created by the stores served directly, and it still hurts us in the high-end price issue."
 },
 {
  "REGULAR": "good products"
 },
 {
  "REGULAR": "The difference in price between an exclusive customer who buys little and a multi-brand customer who has a high volume is very small.\n The discount should be more tied to volume than anything else, as it used to be.\n\n Lots of bureaucracy to solve technical problems.\n\n All sellout information is passed. Why are goals about purchases and not sales?\n\n In every survey, we asked for a modification to the Selfcolor system so that dosing errors are reduced. They need to place a barcode reader to identify if the base is correct for the color. And a field to indicate which salesperson dosed the paint."
 },
 {
  "REGULAR": "Basf is no longer an exclusive company with its partners, opening several distribution channels in the same area of activity, conflicting Basf with Basf. The brand was pulverized."
 },
 {
  "REGULAR": "THE PRODUCT IS GOOD, BUT THE PRICE IS NOT LEGAL... AND THE SAC... IS VERY BAD"
 },
 {
  "REGULAR": "The price is still a little above the current one."
 },
 {
  "REGULAR": "Commercial policy between retailers and distributors is very similar."
 },
 {
  "REGULAR": "Company with innovative solutions..\n Good technical features..."
 },
 {
  "REGULAR": "I think BASF leaves a lot to be desired, especially with its select partners."
 },
 {
  "REGULAR": "A big name company, but that has greatly reduced the quality of the product. Unfortunately!"
 },
 {
  "REGULAR": "BASF is recognized for its excellence in the quality of its products, but in terms of customer service or the account manager it leaves something to be desired with very long and \"stuck\" returns."
 },
 {
  "REGULAR": "(+) Solid company.\n (+) Committed officials.\n (-) Very high prices and high commercial demands."
 },
 {
  "REGULAR": "SERIOUS PRODUCT AVAILABILITY AND PACKAGING QUALITY PROBLEMS"
 },
 {
  "REGULAR": "They are products in which we could integrate them in integrated management"
 },
 {
  "REGULAR": "Quality in its products"
 },
 {
  "REGULAR": "We are a small client, and therefore the impersonality in the attention is quite noticeable."
 },
 {
  "REGULAR": "Based on all aspects of the business relationship. Products.Service.Delivery of merchandise.Information.Conditions of sale."
 },
 {
  "REGULAR": "Very good products, with development possibilities in the Argentine market but without continuity."
 },
 {
  "REGULAR": "The products are good. Sometimes things change without consulting and not having studied the implications well. In addition, being a large corporation commanded from another place, they make decisions that do not favor the Clients."
 },
 {
  "REGULAR": "Little flexibility and availability of items for not having the volumes of the mega companies"
 },
 {
  "REGULAR": "The qualification in this opportunity goes down, due to factors such as:\n\n 1. Change of personnel in the support areas, which affect customer service. Confirmation of information, detailed monitoring and promptness in the required responses\n 2. Missing material allocation\n 3. Change in the agreed conditions, price and rebate"
 },
 {
  "REGULAR": "Few raw materials available in the market\n Long delay in restocking"
 },
 {
  "REGULAR": "have the necessary knowledge"
 },
 {
  "REGULAR": "Because the prices of the chemicals that they offer to CHAIDE are well above the offer of various suppliers.\n The level of compliance with timely delivery of orders is low."
 },
 {
  "REGULAR": "In business year 2021, we had supply issues, I understand that all companies had. The shortest way to communicate was what was lacking."
 },
 {
  "REGULAR": "I feel that in my area, there are very few products that can be developed."
 },
 {
  "REGULAR": "They are excellent products, more field support should be given to the distributor's representatives"
 },
 {
  "REGULAR": "They are having inventory problems"
 },
 {
  "REGULAR": "Little product availability in key items, price increase up to 4 times in a year."
 },
 {
  "REGULAR": "They have good products but in the supply they have opportunities for improvement. Apparently they must improve their actions to be able to get the products on time for shipments."
 },
 {
  "REGULAR": "The availability of materials and prices are well above the competition. BASF seems to be the first to make price adjustments in the market and their product offering seems to be either very scarce or their pressure to make what they have profitable is very high, which has caused that basically there is no possibility of closing deals."
 },
 {
  "REGULAR": "They have good products, but their margins are unattractive and price wars between their distributors make the line unprofitable."
 },
 {
  "REGULAR": "Very good service. Constant delays in shipments and ship rollovers have been a major challenge for BASF."
 },
 {
  "REGULAR": "I only know Basf, as a Credenz customer. Regarding the agrochemical portfolio, I only know it from a theoretical point of view, and I approve, but I have never had practical experience as a Basf distributor.\n From an operational point of view with Credenz, our level of satisfaction is a 10."
 },
 {
  "REGULAR": "Above average price."
 },
 {
  "REGULAR": "The portfolio very little\n Lack of product diversity"
 },
 {
  "REGULAR": "lost agility"
 },
 {
  "REGULAR": "BASF offers a very interesting product palette, and provides samples for evaluation and technical assistance as needed, but has been experiencing frequent delays and rescheduling in fulfilling purchase orders."
 },
 {
  "REGULAR": "They are not easily accessible for contact and for possible negotiations and that may occur."
 },
 {
  "REGULAR": "Not very likely due to the cost of the product and the products are not always 100% available."
 },
 {
  "REGULAR": "The products have acceptable quality, however we have had some problems with the supply times."
 },
 {
  "REGULAR": "BASF is being heavily impacted by several force majeure events and raw material restrictions in the market. This brought us a lot of insecurity in terms of supply, as well as price increase announcements for 2022"
 },
 {
  "REGULAR": "Because of BASF's relevance to our business and BASF's business, our partnership should be stronger. I think the MKT actions that BASF carries out in our region are of little relevance, all very complex without a vision of commercial partnership. The products come imposed without prior work with the network of influencers and recommenders."
 },
 {
  "REGULAR": "Basf's portfolio has some products inferior to other companies, and even so there is an insistence on the sale, impacting on rebate payments. Regarding rebate, it's a lot of rule, being difficult to interpret"
 },
 {
  "REGULAR": "Good Products."
 },
 {
  "REGULAR": "would not recommend to a fellow dealership as there is an overlap of BASF dealers in the region.\n would mend for the quality of the products and for the research part."
 },
 {
  "REGULAR": "Excellent products, but a difficult company to negotiate and not so trustworthy."
 },
 {
  "REGULAR": "Good portfolio and good quality of products."
 },
 {
  "REGULAR": "I believe there is considerable room for improvement in understanding customer needs. Many unnecessary conflicts and lack of a strategy where the real competitor is the other manufacturers."
 },
 {
  "REGULAR": "Trade policy on redistribution with very low margins due to price war."
 },
 {
  "REGULAR": "An important partner of the Group, but at the time of support and support regarding costs in the pandemic, it was not flexible, we always had to adapt to its points. We were concerned about how the loss of business due to this seemed to have no importance."
 },
 {
  "REGULAR": "Difficulty in the negotiation process, delivery x return."
 },
 {
  "REGULAR": "There are 2 things to differentiate, the first is Basf, with which in these 22 years I have had a very good business relationship and I would rate it a 10, but the second is Glasurit, which in these last 2 years I have felt a distance, a lack of support."
 },
 {
  "REGULAR": "Very innovative company, with a well-implemented ESG culture, but with much more expensive ingredients than market competitors, even in commoditized segments."
 },
 {
  "REGULAR": "It is a serious and responsible company"
 },
 {
  "REGULAR": "Positive: Quality products and an excellent line of research.\n\n Negative: Credibility of information and constant product shortages"
 },
 {
  "REGULAR": "Price"
 },
 {
  "REGULAR": "I still had little contact with the brand, but as far as I could monitor and make contacts with BASF's technical assistance, I was very well attended."
 },
 {
  "REGULAR": "Many distributors in the same area selling the same product. This takes the focus off the quality of the product and the technical assistance provided and starts to direct the focus only to those who have the lowest price."
 },
 {
  "REGULAR": "I even improved the score compared to the\n previous."
 },
 {
  "REGULAR": "When talking about CX, an important part of this is the company's culture to put the Customer at the Center of the Process (Customer Centric)... Understand the pain, put the customer's shoes on, participate and support the customer's growth. We perceive at BASF the pro-product culture (Product Centric), still far from what can make the client a Promoter ..... I say this from my client perspective (not generalizing)."
 },
 {
  "REGULAR": "Selling product and no delivery, canceled our finale, heat, and delayed delivery of orkestra and ativum. Not to mention that we realized that Coamo was privileged, for it there was no shortage of product, it is selling even for the next harvest and at a price below cost and we have to keep begging to invoice, so I would not recommend BASF... as for product quality, we have nothing to comment"
 },
 {
  "REGULAR": "We have a great relationship and a supply that works well in the Metabisulfite line, however for some product lines such as Cetyl Oil and DMAPA Alcohols we have had many problems with BASF's supply.\n Service of these two product lines has been very flawed and the answers are not satisfactory."
 },
 {
  "REGULAR": "Disorganization"
 },
 {
  "REGULAR": "They don't have many products."
 },
 {
  "REGULAR": "There is a difficulty in providing quick service at Basf Brasil - our branch is cellulose and we noticed a long delay in the transfer of logistics information.\n We buy an imported product from Basf Germany called Pluriol and the transfer of information is always very slow."
 },
 {
  "REGULAR": "BASF has great products, excellent quality, but the point of improvement would be the service part."
 },
 {
  "REGULAR": "we need more products to serve our customer."
 },
 {
  "REGULAR": "We are still having problems receiving agreed values in 20\/21 harvest campaigns.... Combo Basf... unfortunately"
 },
 {
  "REGULAR": "I have no reason to"
 },
 {
  "REGULAR": "It takes a little more flexibility"
 },
 {
  "REGULAR": "Beyond the quality of the products, the cost is somewhat high for the time of so much competition that we are going through,"
 },
 {
  "REGULAR": "Good morning, today I put that rating, because we are having quite a few problems with the orders placed. I still recommend it. Thanks a lot. Greetings"
 },
 {
  "REGULAR": "predisposition to develop a new product.\n Commitment and response in the delivery of the product.\n Technical and commercial after sales service mbuena\n High financial demands"
 },
 {
  "REGULAR": "I am Brazilian and the vision I had of BASF was always good, of excellence, until 2019 I began to work in painting at the Malvinas plant in Argentina. We had many technical problems and from BASF we did not have satisfactory answers. For several times we penalized our process with changes in parameters, trajectory, rework in pieces due to lack of paint stability, degradation and other problems that until today they could not explain to us. Nor did they demonstrate knowing how to use troubleshooting support tools such as 8D, for example. As for the BASF group, for now I still have a good image, but the same is not the case with BASF Argentina."
 },
 {
  "REGULAR": "Very good portfolio, with a good commercial work team, however with slow and unclear processes, and more investment of the portfolio work in the field is necessary."
 },
 {
  "REGULAR": "Because, in general, it has products suited to the needs of customers."
 },
 {
  "REGULAR": "It has a good range of products, it has been positioning itself in our region. More commercial feed back between distributor and company policies is missing. Seek + win win."
 },
 {
  "REGULAR": "Very innovative, competitive prices, very good quality but internal processes are very rigid and delayed (ability to respond to advances, responses to rejections, etc.)"
 },
 {
  "REGULAR": "Unethical and pass the information of the agreements with large farmers to other distributors"
 },
 {
  "REGULAR": "WE RECEIVE SUPPORT AS AN INDENPENDENT CUSTOMER\n GOOD TECHNICAL ASSISTANCE\n GOOD CUSTOMER SERVICE"
 },
 {
  "REGULAR": "The paint is great, but the delivery has been horrible. in addition to the product being damaged, many banknotes are missing material."
 },
 {
  "REGULAR": "Dealing with financial services, it is a team that makes an efficient and agile service."
 },
 {
  "REGULAR": "Well the offices need to refine the technical area"
 },
 {
  "REGULAR": "Delay in product delivery!"
 },
 {
  "REGULAR": "The product is of quality, but the technical support for problem resolution leaves a lot to be desired, especially in the delay in response."
 },
 {
  "REGULAR": "We think that Suvinil has been losing a lot of space with regard to support and partner along with resellers!"
 },
 {
  "REGULAR": "Great products.\n Doubtful strategy for maintaining partners and customers."
 },
 {
  "REGULAR": "Unquestionable quality, but inflexibility in negotiations interferes with new business, high prices compared to competitors"
 },
 {
  "REGULAR": "We recommend BASF for the performance"
 },
 {
  "REGULAR": "Good product portfolio; recognized brand; on the one hand and on the other, high price dispersion of its products at the level of distribution channels."
 },
 {
  "REGULAR": "Recently, we had a big surprise with BASF's attitude towards canceling orders and delaying the delivery of products, causing us discomfort with clients and company Directors, leaving the sales team in a delicate situation."
 },
 {
  "REGULAR": "Excessive delay in the response of Basf Argentina and Basf Brazil"
 },
 {
  "REGULAR": "Stable product in terms of quality. Price completely unfavorable for the market."
 },
 {
  "REGULAR": "Due to not having delivered the volume of FINALE closed in the 21\/22 campaign, causing a lot of inconvenience and damage to the cooperative."
 },
 {
  "REGULAR": "very expensive prices"
 },
 {
  "REGULAR": "some items are not available for immediate delivery, requiring import within 60 to 90 days, and for continued marketing, it is necessary to place firm orders, which is currently relatively difficult due to market fluctuations."
 },
 {
  "REGULAR": "Good and reliable business partner"
 },
 {
  "REGULAR": "Although BASF has one of the largest product portfolios, it ends up failing a lot in terms of communication, especially in critical times like the one we are experiencing.\n Perhaps this is due to the size of the company, but it is a persistent failure."
 },
 {
  "REGULAR": "either my shopkeeper or customer opinion. as a shopkeeper I give 0 because there is already a lot in my region and the prices are already very low. some moment smaller than cmv"
 },
 {
  "REGULAR": "My grade is based on the lack of shares and low profitability that I, a select client, am going through.\n I have a great example this year. With the consequent table increases, since June until now I have been paying for Suvinil's spaghetti the same amount that is being sold in the market, I have already sent several quotations, home center prints, budgets from non-select clients and clients of distribution, where they can sell the product at the price I'm buying. The answer is always the same, they will increase, but how does someone manage to sell a product for so long for the same purchase price and it's not just spaghetti, we have classic, enamel, etc..\n This makes the margin of the Suvinil brand practically unsustainable for a Select customer that fulfills its objective agreement on a monthly basis.\n Including the profitability. some items at the suggested price by suvinil itself, the margin is well below 30%. I ask, can anyone work with products (several products) with a margin below 30%? Today for science I need a margin of at least 36%.\n I compete face to face with large stores that have a well-considered differential in terms of purchase price and much smaller stores, managed by the owners and family members, with a very similar cost price. See how my scenario is and I don't see any action to improve. In other words, in the commercial policy that I have been following, you are a large retailer or you have to be a micro retailer. We also have the issue of distribution, which sells products cheaper than the factory. Do not be unworthy, this is a fact and proven.\n Anyway, I've been a Suvinil partner for over 15 years, I work the whole line and defend the brand, but unfortunately and based on what I said above among other things, lately our partnership is very unilateral.\n Big hug, good business and I hope that together we can improve this, PARTNERSHIP."
 },
 {
  "REGULAR": "DOES NOT HONOR CLOSED ORDERS."
 },
 {
  "REGULAR": "- Internal strategy to deal with DAS and Resellers reflected in the field. We lost a lot of customers to Akzo. Customers cannot get competitive prices to fight with a large dealer in the region that has aggressive PMA. And DAS is no longer able to squeeze the margin on products.\n\n - Weak marketing. Budget directed to DAS marketing is insufficient. Lack of merchandising materials. Presence in irrelevant media."
 },
 {
  "REGULAR": "I could rate it even higher, but lately I'm dissatisfied with the service provided by the BASF team."
 },
 {
  "REGULAR": "GOOD SERVICE"
 },
 {
  "REGULAR": "Prices are high."
 },
 {
  "REGULAR": "Confused pricing policy\n Can't control the market price\n Pricing policy, distribution better than that of customers"
 },
 {
  "REGULAR": "The brand is strong in the market, the professionals are qualified and the company conveys security in the agreements. The downside is the lack of more involved action in controlling the peak price."
 },
 {
  "REGULAR": "1. Fixed commercial policies, prioritizing volume in large customers instead of margin, generating a generalized mess in the market.\n 2. Product margins are increasingly smaller, making the business less profitable in the face of changes in the market and extra costs that the storekeeper has, such as: equipment maintenance, loss of paint, damage, etc.\n 3. Unfair competition, without preserving the area of activity of ELO\/SELECT partner stores.\n 4. Low investment in POS and commercial actions. There is a lack of creativity in new actions to bring flow to the physical store."
 },
 {
  "REGULAR": "Great portfolio. Serious professionals. Serious company. \/ However, the product delivery schedule is dire, it always arrives late in relation to use. We do not sell Basf products out of stock, which suppresses sales. It's been repeated for years, it's not just this year's 20\/21 problem. They force the delivery of products that you don't need, newly launched products, with faulty diffusion, that is, the product takes a long time to hit the market."
 },
 {
  "REGULAR": "Hello, the products are of excellent quality, but bad logistics, and other failures in service in general."
 },
 {
  "REGULAR": "Low product availability, commercial condition misaligned with the market, little proactivity, not proposing business in advance or taking advantage of opportunities."
 },
 {
  "REGULAR": "insufficient portfolio for HF, lack of insecticides in the line and selective herbicides for HF"
 },
 {
  "REGULAR": "Uncertainty in receiving products.\n - They are not delivering part of what was negotiated\/bought\n - Delay in deliveries"
 },
 {
  "REGULAR": "Very high quality product"
 },
 {
  "REGULAR": "Complete absence of technical support with qualified people to solve technical problems that arise. Service period of up to 30 days, with no return or priority for this type of service, especially for exclusive customers of the brand. There is clear evidence that the commercial and technical areas do not speak and cannot effectively solve the problem as soon as possible. We didn't work for 4 days of the tintometric equipment and only got feedback after several complaints and management involvement. We are very unhappy with the recent event. We are charged and we are required to comply with rules and we do not have any counterpart in a priority and functional service"
 },
 {
  "REGULAR": "Please let us know the reason for your grade."
 },
 {
  "REGULAR": "The quality of the products is unquestionable.\n Basf suffers from the lack of professionals in the field, high turnover, scarcity of products and non-compliance with the portfolios built with the client (in this case cooperative).\n\n abs."
 },
 {
  "REGULAR": "We are building our partnership and we strongly believe that with the commercial team that was renewed, we will be able to have better after-sales results."
 },
 {
  "REGULAR": "They have lost credibility due to defaults in dispatches and in quotes"
 },
 {
  "REGULAR": "They have lead times that are too long, which means they do not have a secure supply"
 },
 {
  "REGULAR": "The response times to all the queries without exception are very delayed, and we have to be asking many times until they finally answer"
 },
 {
  "REGULAR": "For his pursuit of innovation."
 },
 {
  "REGULAR": "Because of the reliability of the chemicals and technical support (Oscar Volpini)"
 },
 {
  "REGULAR": "High quality and efficient products, but poor customer service."
 },
 {
  "REGULAR": "Until the month of June we would have given it a 10 but for reasons of the company not of who manages us we lowered it to 7"
 },
 {
  "REGULAR": "I would recommend it for the technical advice and quality. However in the industry I work (tannery) I don't see much participation from BASF"
 },
 {
  "REGULAR": "is a brand recognized by the workshop owner, innovation characterizes them both in colorimetry and in products"
 },
 {
  "REGULAR": "IT IS A VERY GOOD COMPANY BUT TODAY IT HAS PRE-PIPELINE AVAILABILITY PROBLEMS."
 },
 {
  "REGULAR": "BASF does not honor the commercial terms of the agreements."
 },
 {
  "REGULAR": "CUSTOMER SERVICE"
 },
 {
  "REGULAR": "BASF has products of excellent quality, however it has little capacity to respond and to anticipate logistical problems (pandemic) or quality observations (example: packaging problems that are only detected when the material arrives and is individually reviewed)."
 },
 {
  "REGULAR": "In recent times, BASF has looked more at its business than the strategic relationship with its customer. Although it has not stopped supplying us, as the paint business was more profitable for it, it marginalized the latex for paper business and therefore breached the consignment agreements at the plant, putting our production at risk. For this reason lower your score to 7 points."
 },
 {
  "REGULAR": "For the recent decisions in its trade policy."
 },
 {
  "REGULAR": "Failure to supply raw materials."
 },
 {
  "REGULAR": "Very good products, but with important problems in Logistics"
 },
 {
  "REGULAR": "Sometimes they do not have product availability, and the responses are not so fast"
 },
 {
  "REGULAR": "Good attention and service"
 },
 {
  "REGULAR": "It only has specific materials; and the conditions offered in general are not necessarily the best on the market."
 },
 {
  "REGULAR": "They have quality materials."
 },
 {
  "REGULAR": "Good morning, I'm rating this survey 5 because I don't understand the question.\n\n When you refer to what extent would you recommend it, from what point of view is the question:\n\n From a technical point of view, the quality of its products as a technical response in the field.\n From the point of view of Business, that is to say how the experience of working with BASF as a supplier of products has been.\n\n From the point of view of service, how has the customer service or customer experience been for us based on what we have shared.\n\n If you help me with this clarification, I would be happy to give you my comments and feedback.\n\n Greetings,"
 },
 {
  "REGULAR": "It is understood that due to the current situation, and all the new limitations, the supply, price and shipment of products have been affected, but perhaps there are measures that could be adopted to reduce the impact."
 },
 {
  "REGULAR": "The quality of the products is not in doubt, but currently the availability is doubtful and uncertain. In addition, when closing a business, it is not invoiced and therefore the exchange rate runs even when we decide to pesify"
 },
 {
  "REGULAR": "They have very good quality but they take a long time in technical answers and it is not clear at times who it should be addressed to, they are very large and we do not have an account manager only for the company but many depending on the business segment."
 },
 {
  "REGULAR": "High reliability products, good service performance (quality \/ logistics), but high prices."
 },
 {
  "REGULAR": "I understand that Suvinil has a vast mix of products and solutions for its target audience, but every day it becomes more distant from the reality of many obtaining a suvinil product, due to the constant increase in its high-end prices, in view of the large offer of products with similar performances!"
 },
 {
  "REGULAR": "Difficult to solve some problems."
 },
 {
  "REGULAR": "Lack of product."
 },
 {
  "REGULAR": "It's been a long time since I made the last purchase, however, I remember that we had a delay in the information about the ship's booking (10 days), since we were urgent in receiving the cargo."
 },
 {
  "REGULAR": "I think the service and proximity to customers should be improved."
 },
 {
  "REGULAR": "Only for the price they are equal to distributors in Brazil. Little price difference."
 },
 {
  "REGULAR": "There is a lot of lack of a customer relationship with the sales force"
 },
 {
  "REGULAR": "I need to improve the relationship and return program for the distributor and sales force.\n Be simpler and easier to understand."
 },
 {
  "REGULAR": "Material technology, service. Factory in Brazil of polymers."
 },
 {
  "REGULAR": "Company is not a partner of the customer"
 },
 {
  "REGULAR": "I really like the work of BASF and also the diversity in the portfolio with various types of materials to offer, but it is worth remembering that in the recent past we had a serious crisis in relation to the supply of material produced by the local BASF and this generated great internal stress for Unilever, apart from the super on cost that we didn't expect, it was very disappointing, so I can't rate it higher either"
 },
 {
  "REGULAR": "We have been working with BASF for over 20 years, which has remained serious about prices and supply even during the pandemic period."
 },
 {
  "REGULAR": "lack of service"
 },
 {
  "REGULAR": "LACK OF MERCHANDISE"
 },
 {
  "REGULAR": "We have received little support for the development of their products, a lot of invasion of zones and low profitability in the business"
 },
 {
  "REGULAR": "IN THE LAST TIME THEY HAVE NOT COMPLIED WITH PORTLAND'S NEEDS IN RELATION TO DOCUMENTATION AND SHIPPING DATES"
 },
 {
  "REGULAR": "Quality products with high customer reliability. Does not give higher marks due to failures and delays in service."
 },
 {
  "REGULAR": "The recommendation is relative since Basf being such a large company is sometimes more complicated for medium-sized clients."
 },
 {
  "REGULAR": "The constant lack of products, especially from the A curve, as we are exclusive, this constant lack of products has harmed us a lot, we are losing a lot of sales.\n Not to mention the lack of partnership to promote the brand within the point of sale, e.g. Uniforms, store rug, Tax coupon, Bag, inflatables, adhesives for delivery vehicles, etc.... At the same time, we are very Well serviced by our consultant Carol, who has done everything to minimize the logistical problem that has persisted since 2018."
 },
 {
  "REGULAR": "Information does not flow as if we were working as partners. More closeness, technical-commercial support is lacking."
 },
 {
  "REGULAR": "Good quality of products, good information, reliable.\n Improve supply in place and shorten delivery times"
 },
 {
  "REGULAR": "For trust in the company."
 },
 {
  "REGULAR": "the leading brands in the market have many distribution channels, so high-end prices are very difficult to be controlled, the big industries at the moment are having bigger problems with delivery than the smaller ones, even because of their larger market share, even understanding this, it causes a very big inconvenience for us who prioritize selling branded products"
 },
 {
  "REGULAR": "The partnership with Suvinil is very complicated.\n You are not able to establish market prices and it is becoming impossible to sell the brand.\n The other retailers (Elevato, Sul Cores, Aquarela and Thony) are selling at prices up to two increases back and we are having to convert our sales into other brands to be able to sell with a healthy margin.\n In addition to pulling the market down, we also get a reputation for paying customers."
 },
 {
  "REGULAR": "Basf works with excellent quality products, but for some sectors it does not take into account the partnership with the customer, for example, we had cases of orders closed with BASF and already with acceptance of supply and upon delivery, BASF simply informed the decline service, without giving the customer a chance to study together a solution to the problem. Another sector that we deal with with BASF asks us to place our orders, but they do not guarantee service, which in our understanding does not bring any guarantee of supply and exposes us to a very high risk of shortages."
 },
 {
  "REGULAR": "The lack of products in the Basf portfolio gives reason not to widely recommend the brand."
 },
 {
  "REGULAR": "Company with excellent technical capability"
 },
 {
  "REGULAR": "lack of deliveries"
 },
 {
  "REGULAR": "Grade 10 = Brand credibility \/ Consultant Service\n\n I didn't get 10 due to logistics and shipping failures.."
 },
 {
  "REGULAR": "You cannot argue with the quality and that they are creators of chemistry, with affordable prices.\n\n Only in my opinion they should improve what is in the logistics environment.\n Greetings and grateful for your collaboration and I am at your disposal for whatever you need.\n Angel"
 },
 {
  "REGULAR": "Good quality of the products and good sales service, but many problems to deliver in recent months (just like the whole market by the way). This caused us to lose customers and a lot of pre-sales work. We almost have to start over with the brand."
 },
 {
  "REGULAR": "The attention of the account is good, the products also, payment term 60 should go to 75 days"
 },
 {
  "REGULAR": "UNCERTAINTY REGARDING THE DELIVERY OF PRODUCTS"
 },
 {
  "REGULAR": "We are having many problems with the fulfillment of the delivery dates and the functionality of the RA 288 product (Consult our quality department)"
 },
 {
  "REGULAR": "Lack of local stock for products that are not within the planning."
 },
 {
  "REGULAR": "Although the quality and performance of the products purchased is excellent, given the current situation, an opportunity for improvement is identified at the logistics level and in response times in general. Improving flexibility in processes is also key as an adaptive change in the face of today's challenges, implementing effective and immediate action plans in order to improve various aspects such as coverage inventories, reserves and booking for imports, etc. taking advantage of the robustness of a company like BASF. In the same way, the timely and detailed communications on alerts and the work on the identification of risks in advance could be improved taking into account the scope and the possible tools that BASF could have to access said information. As BELCORP we recognize the effort made by all the teams within basg throughout the year to provide support in the face of new developments and guarantee timely supply."
 },
 {
  "REGULAR": "Product quality is very good\n It is recognized worldwide\n But the quality of customer care and service in Peru is very limited due to the following:\n - Deficiency in the availability of products that involve product kits (varnish, catalyst and solvent)\n - Delays in international imports that greatly affect the stock break\n - Lack of availability of color tools for customer service (catalogs, color guide, shades of gray, among others\n - Lack of attention and advice in physical or virtual presence"
 },
 {
  "REGULAR": "the prices in general are reasonable, the attention is good although there is a lack of more details regarding the shipment scheduling. We need information on the probable date of shipment and BASF insists on informing the estimated arrival date, finally it ends up embarking on the date of our need at destination.\n What the shipping lines estimate less and less conforms to reality."
 },
 {
  "REGULAR": "They are a serious company that can be more competitive in prices and services."
 },
 {
  "REGULAR": "Quality product"
 },
 {
  "REGULAR": "They must internally evaluate the quality of services"
 },
 {
  "REGULAR": "First of all, we continue to have delays in the delivery of orders, we understand that worldwide there are complications of ship availability, container availability, etc. But we feel that BASF or its logistics operator does not fully control the operation.\n On the other hand, with regard to the supply of chemicals, we have been forced to look for other suppliers because BASF does not have chemical availability, as is the case with Polyol Convecional; o The prices of its chemicals have a difference of more than 10% with the existing supply worldwide. The message we get from BASF is that they can't do anything with prices, this causes us to buy more products from other Asian suppliers."
 },
 {
  "REGULAR": "Because I have been working with basf for 2 years and I don't have a contract.\n The prices are not competitive for brands in the same category and the gross margin is not extremely low for other businesses that I have. When I started, they told me about margins that are actually the lower half.\n The charge d'affaires of my country does not answer emails or calls and does not do what he promises to do."
 },
 {
  "REGULAR": "Excellent quality and attention"
 },
 {
  "REGULAR": "It depends on the origin it leaves, we have many problems with foreign trade."
 },
 {
  "REGULAR": "They offer good products, but they are not agile in the supply."
 },
 {
  "REGULAR": "Good service and quality of products"
 },
 {
  "REGULAR": "proximity"
 },
 {
  "REGULAR": "Delay in deliveries and lack of material availability."
 },
 {
  "REGULAR": "The portfolio with little solution to our problems"
 },
 {
  "REGULAR": "Sometimes, we take a long time to get feedback on the question asked. I know that we often depend on responses from other countries, but it is worth sending even a line to the customer, stating that the matter is being addressed."
 },
 {
  "REGULAR": "Sandra's support has been excellent, I have no doubt that she has always made the maximum effort to provide us with the information in a timely manner.\n The qualification has to do with the low availability of raw materials that are normally used such as Basorol 9954A, IDCAP and Basoplur P4000 for Ecuador."
 },
 {
  "REGULAR": "I consider it to have good products, very good technical support but very low commercial flexibility"
 },
 {
  "REGULAR": "the products are good, but the costs are high"
 },
 {
  "REGULAR": "We have had late deliveries."
 },
 {
  "REGULAR": "Product quality, ...."
 },
 {
  "REGULAR": "The commercial attention and the product are of excellence. Year-over-year availability continues to have issues."
 },
 {
  "REGULAR": "Reliable company in quality"
 },
 {
  "REGULAR": "The main reason is to combine order schedules and values and not to honor later and change the commercial condition, this does not generate credibility, we understand that if we have an approved and agreed PO, they must be complied with."
 },
 {
  "REGULAR": "Many dealers authorized by BASF in the same city, apart from products that come from abroad. That BASF does not shy away from this."
 },
 {
  "REGULAR": "FOR THE BROAD PORTFOLIO, EFFICIENCY OF PRODUCTS AND TECHNICAL SUPPORT."
 },
 {
  "REGULAR": "In short, there would be an excessive lack of merchandise since before the pandemic and also excess bureaucracy in some processes."
 },
 {
  "REGULAR": "Crop - excellent products, but serious problems in distribution, not to mention that we have been without a manager for a long time. We have a feeling that we are in the background for Basf.\n TSI - products losing performance, but with a very good policy and a very competent area manager (pedro lara)"
 },
 {
  "REGULAR": "Technical misalignment between RTV BASF and the Cooperative's Technical Coordination."
 },
 {
  "REGULAR": "BASF has a great product portfolio and we are very interested in increasing our partnership with you, but we have not been able to do business directly with you in some segments due to your policy of selling through distributors. We have also noticed that the prices currently offered to GRUPO LIMPPANO do not take into account our potential and growth."
 },
 {
  "REGULAR": "If you are a consumer friend, I would give 10, if you are a friend interested in becoming a storekeeper, I would give 2. I am select, I have pending orders with basf for 8 months, products of the curve A type acrylic matte, light touch, nail polish for more than 60 days , for those who only work with one brand, this is terrible. Our bongo van always circulated around the city with the Suvinil brand, this time the adhesive was denied."
 },
 {
  "REGULAR": "Greater clarity in the discount policy.\n Too much breakage of curve A products.\n SERIOUS problem of commercial policy of Distribuidora Progresso, practicing prices of final consumer for tenants."
 },
 {
  "REGULAR": "It wasn't bigger because the points program is very complicated and bad"
 },
 {
  "REGULAR": "PRICES ABOVE THE COMPETITION"
 },
 {
  "REGULAR": "The quality of the products is indisputable; however, availability and costs are very high and the time taken to obtain samples or fulfill orders in recent months has imposed a series of difficulties on the business."
 },
 {
  "REGULAR": "Logistics structure leaves something to be desired"
 },
 {
  "REGULAR": "many plant problems, delay in delivery ...."
 },
 {
  "REGULAR": "Exclusive supplier, has served us well, but there is always room for improvement."
 },
 {
  "REGULAR": "The problem is that as Basf works with a wide range of products, it is often difficult to find out who are the people responsible for certain products. So my grade is 6 because it would be restricted to the two products I've already imported, and I wouldn't know who to recommend."
 },
 {
  "REGULAR": "Good Morning . I know we are going through difficult times , and the market is increasingly competitive , but forgetting about small and old customers is a kind of weird policy ........ So ..... this is my grade ."
 },
 {
  "REGULAR": "As an end customer, yes, as it has a consistent portfolio for our target cultures.\n As a reseller, it needs to improve, as we have several problems of consistency in pricing and sometimes there is a feeling of distance from our company.\n Good job of generating demand in the field."
 },
 {
  "REGULAR": "Distancing"
 },
 {
  "REGULAR": "Today, with Basf present in a very strong way in the cooperatives, they have been causing a reflection in the distributor, about their future with it"
 },
 {
  "REGULAR": "Harvest Price Policy 21-22 have not arrived until and would have needed to arrive weeks ago. This type of situation is very detrimental to the planning of our company. The market demands us more and more in advance and not the other way around ..."
 },
 {
  "REGULAR": "If this question had been asked me a year ago my grade would be a 10, today we are abandoned, little concern for our area"
 },
 {
  "REGULAR": "I recommend"
 },
 {
  "REGULAR": "It remains to define a better commercial strategy and link the technical and local team with the market and its realities for more concrete and practical support actions"
 },
 {
  "REGULAR": "They are getting very complicated to negotiate"
 },
 {
  "REGULAR": "good products ........ but product information is little available"
 },
 {
  "REGULAR": "Deliveries are a bit"
 },
 {
  "REGULAR": "The quality is indisputable, maybe that's why I could recommend it with a 10, but there are very few business opportunities. Maybe that's why I put a 7"
 },
 {
  "REGULAR": "From the place of the Basf distributor or dealer. We would like to have more support in actions related to how to grow within the area. More accompaniment in POG. Access to targeted \/ specific training."
 },
 {
  "REGULAR": "LACK OF SUPPORT TO THE DISTRIBUTOR IN DEMAND GENERATION, PRODUCT WITH NEXT EXPIRATION DATES, DELAY IN LEGALIZATION OF PROMOTIONAL PROGRAMS (INCONFORM CUSTOMERS)."
 },
 {
  "REGULAR": "I think it is an acceptable average, since they have good proven products, the only thing that is competing with other companies that give them away, that goes to the detriment of being recommended over other chemicals, in order to compete on price and not quality"
 },
 {
  "REGULAR": "Considering that BASF has an excellent palette of products, the prices that come out to the market do not favor the generation of demand. Being the distributors who burst the prices who close the deals."
 },
 {
  "REGULAR": "More presence of BASF is needed to monitor its products in the field."
 },
 {
  "REGULAR": "I am a distributor and sometimes the areas and prices are not entirely clear"
 },
 {
  "REGULAR": "Good morning, for years our Company has faithfully adopted you as exclusive Suppliers of Styrofan RX411 latex and in a matter of days they communicated to us the decision of BASF to drastically reduce the amount of material to be produced and to deliver us monthly, even by changing the item in question despite having them asked for a reasonable period of time to have the chance to reorganize and not nearly as happens today, having us paralyze the production of our Industrial Plant. Yes, I highlight the professionalism and goodwill of the Czarnitzki Technical Salesperson who, within his possibilities, has tried to comply with us."
 },
 {
  "REGULAR": "The recommendation would be for the palette of products, mainly herbicides. in the case of insecticides, having a limited palette, I would not recommend it"
 },
 {
  "REGULAR": "In the last time they have delayed deliveries and have delivered products out of specification."
 },
 {
  "REGULAR": "First of all, I want to clarify that I am aware of the context that we are experiencing at the country and global level, I am patient in terms of claims and in solidarity to seek joint solutions. That said, I want to let you know my disagreement with situations that have occurred in the last time:\n - Delays, in excessive cases, in the delivery of the merchandise.\n - Rustic and tedious processes for the times we live in (orders, payments, investments).\n - Missing merchandise.\n - After-sales, I think we have to find a new approach to assist the workshop, the shirt became obsolete, another type of collaboration is required in my opinion.\n\n Despite my age, I have known the business for more than 20 years and Glasurit for almost the same time, I feel completely identified with the brand, however, today I believe that we do not follow the speed of change typical of modernity. If I can be useful in something I am at your disposal to collaborate.\n\n Say hello atte.\n\n Nicolás Amezcua."
 },
 {
  "REGULAR": "Company with high quality standards, sustainable business relationship in the long term,\n wide, innovative and growing product palette."
 },
 {
  "REGULAR": "In general, they have a good service, however, situations have happened to us that hinder the commercial relationship. For example...\n Once I contacted the customer service whatsapp and they asked me to only speak to the mail.\n On the other hand, although we have an agreed purchase condition, they always issue us debit notes for exchange differences.\n Another aspect is that it is very bureaucratic to get information from BASF. For example, on one occasion they issued a wrong debit note and we had to contact several people to get answers.\n Lastly, there was a period of time in which the person in charge of attending us was on vacation and during that time they misplaced 2 of our orders, which led to a very important lack of raw material."
 },
 {
  "REGULAR": "Good service and response to technical inquiries."
 },
 {
  "REGULAR": "They are excellent suppliers, but it is very cumbersome to find the exact person for the required product and many times I resort to another option because I do not have an answer."
 },
 {
  "REGULAR": "delivery instability"
 },
 {
  "REGULAR": "Due to the extremely long deliveries and the great lack of product."
 },
 {
  "REGULAR": "The issue of Agross greatly hinders any claim to growth and reliability at Basf on the part of any distributor."
 },
 {
  "REGULAR": "For the quality of the material, I would certainly recommend it. By not meeting the agreed deadlines in orders scheduled too far in advance, BASF loses credibility."
 },
 {
  "REGULAR": "We are satisfied with Basf products. The Brand is strong in our region, having great credibility in the market and a high perceived quality, however in the last year we had many problems related to the company's logistics. Basf had many difficulties in delivering the products. We suffer from constant shortages, consequently with lost sales. These losses are aggravated precisely because we have an exclusivity contract with BASF. If BASF doesn't deliver, we don't have a choice for the customer, so we lose out to the competition."
 },
 {
  "REGULAR": "BASF is an excellent company, with excellent products and reliability. However, the finish areas being passed on to distributors lose quality in service and logistics, in addition to having the highest product values in relation to the competition."
 },
 {
  "REGULAR": "Stable product, but BASF is difficult in terms of logistics and risk mitigation in the production chain"
 },
 {
  "REGULAR": "Company with a good portfolio of pesticides, but with accentuated price dispersion."
 },
 {
  "REGULAR": "BASF has good technological solutions, but its pricing policy is predatory. The way it treats prices makes the \"price war\" to lower prices and not to keep and raise them."
 },
 {
  "REGULAR": "Great portfolio but commercial difficulties and product delivery delays"
 },
 {
  "REGULAR": "IN THIS NEW STAGE OF NEGOTIATIONS, THE DISTRIBUTORS ARE LEFT OUT OF BUSINESS, SINCE IT IS NO LONGER ATTRACTIVE FOR MY COMPANY TO MARKET BASF PRODUCTS, UNTIL THE PREVIOUS CYCLE, EVERYTHING WAS GOOD BUT THIS YEAR I DON'T THINK I WILL BE ABLE TO REACH THE GOALS AND MEET THE GOALS THAT THERE ARE OTHER COMPANIES THAT TAKE US MORE SERIOUSLY AS BUSINESS PARTNERS, WHERE WE CAN COME TO AGREEMENTS, AND HERE IT IS DOING THE OPPOSITE ONLY IMPOSITIONS BY BASF WITHOUT TAKING INTO ACCOUNT OUR WORK OR COMMENTS."
 },
 {
  "REGULAR": "I think that Basf at certain times has prices far above the market, compared to its main competitors"
 },
 {
  "REGULAR": "great product, great market acceptance, great cost benefit, price practiced by the market and manufacture does nothing zero.\n\n there are shopkeepers selling for years without paying operating costs and there is nothing to stop the factory."
 },
 {
  "REGULAR": "Good quality product and good technical assistance"
 },
 {
  "REGULAR": "Just one of the brands we work on..."
 },
 {
  "REGULAR": "Several"
 },
 {
  "REGULAR": "UNFAIR COMPETITION IN THE MARKET, BASF HAS NO CONTROL OF GENERIC DYES USED IN THE MARKET WHICH CAUSES A VERY BIG PRICE DIFFERENCE FOR THOSE WORKING WITH ORIGINAL."
 },
 {
  "REGULAR": "Although they are good products, they do not generate profitability for the business."
 },
 {
  "REGULAR": "Basf's incentive program for sales and rebiting for cooperatives is not very aggressive. Good products and good access policies."
 },
 {
  "REGULAR": "Good company, portfolio leaves something to be desired"
 },
 {
  "REGULAR": "Good service, however the company is very plastered in relation to requests (payment term for example)."
 },
 {
  "REGULAR": "Exclusive delivery policy.\n Despite repeated requests, we are not met.\n We have already passed and we are going through difficult times as an exclusivity not to be supplied."
 },
 {
  "REGULAR": "Strengths\n * Products with good performance;\n * Portfolio that meets the needs of the resale and producers;\n * Sales team with good knowledge about the products.\n\n Negative points\n * They would need to be more effective in solving problems that occur with products in their portfolio at the producer."
 },
 {
  "REGULAR": "As an agro-inputs marketer, the profitability of this line has been reduced by the price war caused by such open distribution and very low suggested minimum prices."
 },
 {
  "REGULAR": "Excellent quality products, however, little flexibility to meet the needs of small customers."
 },
 {
  "REGULAR": "Committed and ethical company"
 },
 {
  "REGULAR": "Different conditions are being applied in channels here in Rio Grande do Sul-in this specific case the conditions are totally different which caused big problems in the market- in our specific case in Tupanciretã we lost 50% of customers and automatically of billings- this channel is the 3 goals that he now runs within Basf and buys the market at prices below the cost of other distributors"
 },
 {
  "REGULAR": "I only miss ten because I lack agility.\n and I do not agree with commercial policy to be very similar to BAYER.\n With good products what should be done and simplify policies and be collective\n ."
 },
 {
  "REGULAR": "Very good commercial team and gives me all the necessary support, but we have already faced difficulties with the technical team in the past."
 },
 {
  "REGULAR": "BASF's Commercial Imposition at the end of 2019 was a true CHAOS, significantly impacting the relationship we had between customer x supplier.\n\n Today I look at this relationship more clearly, but we still have a \"foot\" behind BASF"
 },
 {
  "REGULAR": "SOME INSTABILITIES IN RECOMMENDING THE PRODUCTS."
 },
 {
  "REGULAR": "Commercial stance resulted in the breaking of a relationship of more than 30 years."
 },
 {
  "REGULAR": "There is currently a shortage of material on the market, affecting our operation"
 },
 {
  "REGULAR": "A supplier that demonstrates credibility."
 },
 {
  "REGULAR": "Product quality is not the same. Lack of merchandise, expensive price. Unfair competition in the same Suvinil shopkeeper. Change of Management almost every year, this greatly affects the development of the region with the brand.\n But the main problem is the unfair competition with the same brand, this is forcing me to place other brands within our group of stores."
 },
 {
  "REGULAR": "I would recommend it with reservations as I am dissatisfied with a recurring undue commercial posture of the company."
 },
 {
  "REGULAR": "I have a close relationship with Basf that has now exceeded 48 years. Last year, at the beginning of the pandemic, we at Palmeira Tintas made many commitments to Basf and with the intention of maintaining our numbers with the company. Unfortunately, we were unable to honor all commitments within the agreed deadline. Aid was offered and the outstanding balance was financed, with financial cost, until June this year. We had the promise that they would gradually restore our credit according to the payments. However, since last year we were only allowed to buy in cash (with 5 days and a credit limit of R $ 10,000 per store), causing us difficulty in working with the brand, causing the stores to run out of Suvinil. We find this attitude inelegant because we have always been recognized in the market as examples of a Basf customer and the lack of credit has caused us great embarrassment. We were forced to appeal to other suppliers to ensure the stores' survival. Even though we are a customer with a potential of one million liters, we believe that we have not been treated correctly by the company's financial sector. I am hurt and so are my employees because we are passionate about Suvinil. I thought that the treatment given to the subject was very cold and disproportionate to my history and everything I did for the brand. Fernando Palmeira."
 },
 {
  "REGULAR": "We recently had a very significant loss due to non-compliance with the contracted tonnage of hydrosulfite."
 },
 {
  "REGULAR": "Nowadays, it is very difficult regarding technical information about delay or unavailability or alternatives of MP Basf."
 },
 {
  "REGULAR": "We are in a strategic alliance process to achieve competitive advantages."
 },
 {
  "REGULAR": "I recommend it for its quality, but the cost is very high."
 },
 {
  "REGULAR": "Is what I consider"
 },
 {
  "REGULAR": "good quality"
 },
 {
  "REGULAR": "Quality products, but with poor delivery timeliness."
 },
 {
  "REGULAR": "Portfolio of products in my area, quite complete."
 },
 {
  "REGULAR": "really the service is not good!"
 },
 {
  "REGULAR": "Because planning is not in Chile, the response time is very long, many times, the requirements or queries are lost"
 },
 {
  "REGULAR": "BASF is a provider that strives to deliver a good service to its customers, they care about following up on cases and having information on time."
 },
 {
  "REGULAR": "Good quality of merchandise, very high prices."
 },
 {
  "REGULAR": "lack of stocks and delay in deliveries"
 },
 {
  "REGULAR": "The attention from the seller is excellent, but from the management there is no contact with the needs of the company you need and it is different in each area.-"
 },
 {
  "REGULAR": "VERY GOOD PRODUCTS\n LOW DEVELOPMENT AND LOW GENERATION OF BUSINESSES IN THE AREA\n UNINTENDABLE AND NON-AGREED OBJECTIVE PLANS, NOT ADEQUATE\n POOR CLARITY PRICE LIST AND PRICE AND COMMERCIAL POLICY IN THE AREA\n INFLEXIBILITY, LITTLE LISTENING TO CUSTOMER NEEDS"
 },
 {
  "REGULAR": "Good products, but stiff service"
 },
 {
  "REGULAR": "We have not received a satisfactory response from the ED Dispersiones Acrilicas business after several emails and phone calls regarding the S 702 and S 400 seriously affecting production, we had to quickly go out to find competitive products and approve them in a short time since the answer was without certainties."
 },
 {
  "REGULAR": "It is a supplier with excellent products, however its commercial strength is limited for Colombia, its logistics are slow, and they leave and enter the market very intermittently."
 },
 {
  "REGULAR": "Lack of presence in the area and permanent support to farmers, this generates trust between the supplier and us, the brand is not everything, it requires monitoring of applications and support to our customers"
 },
 {
  "REGULAR": "They are a very high level product, and with great safety"
 },
 {
  "REGULAR": "I believe that BASF is a very large multinational company, with different businesses throughout the world, where it has highly developed and advanced processes. For our specific product such as adhesives, in the industry where I work, I have not had the opportunity to compare it with another supplier, but we continually work as a team to improve our management and constantly communicate. I think we still have many opportunities for improvement and development."
 },
 {
  "REGULAR": "Due to the lack of presence of the Company, in support of medium and small customers"
 },
 {
  "REGULAR": "Is that the approach process is very bureaucratic, especially for small clients such as ours."
 },
 {
  "REGULAR": "Quality and service"
 },
 {
  "REGULAR": "product quality and on-time delivery."
 },
 {
  "REGULAR": "Post-sale problems"
 },
 {
  "REGULAR": "Supplier with good technical solutions, however we have faced many problems in the progress of the activities due to the high degree of bureaucracy in the processes and low speed of return. We have faced many problems with internal errors that end up directly impacting the business. We had a lot of billing errors and low pro Basf activity in adapting to the business model proposed by the client (new recon calculation methodology)."
 },
 {
  "REGULAR": "I've worked at BASF with a brewer responsible for DIVERGAN in Latin America and Central America and I know all the ISSUES that teams need to overcome.\n\n And as a BASF distributor for over 20 years, I can say that BASF is a solid company and that it has very high quality products.\n\n I think there are points for improvement, but in general I would definitely recommend BASF.\n\n I take this opportunity to praise the excellent work of three people who contribute a lot to the good development of the business. Bruna Marcatti, Fernando Garcia Nunes and Joana Kaori Yamazaki."
 },
 {
  "REGULAR": "Little support in the commercial part does not interact itself. Business the idea is win and win"
 },
 {
  "REGULAR": "Price is not so attractive"
 },
 {
  "REGULAR": "They have little local stock and replenishment takes a long time"
 },
 {
  "REGULAR": "\"Chronic\" problems with C40L, B36LN and B36L product packaging. Cardboard boxes without mechanical resistance suitable for the volume and type of material!"
 },
 {
  "REGULAR": "This will depend on the structure of the business I'm referring to. BASF is a very bureaucratic company in its processes and in most situations it is UNILATERAL, always dictates the \"GAME\". The shopkeeper is hostage to a system."
 },
 {
  "REGULAR": "We were not happy with the credit assignments proposed by the company, which made the process very complicated."
 },
 {
  "REGULAR": "Quality materials and good after sales support of the technical part. I am always taken care of in the requests I make."
 },
 {
  "REGULAR": "Quality."
 },
 {
  "REGULAR": "I don't believe in commercial policy."
 },
 {
  "REGULAR": "Basf,\n Very good company for product portfolio. But very uncompromising in the models and forms of negotiation.\n Daniel."
 },
 {
  "REGULAR": "The delivery times agreed with the supplier do not comply with what was agreed."
 },
 {
  "REGULAR": "is trustworthy"
 },
 {
  "REGULAR": "as excellent repainting, but the price difference with the competition is very large."
 },
 {
  "REGULAR": "Because it has the backing of a transnational company and a world-class quality of its products all over the world. However, in the current situation of the Peruvian branch, it has to greatly improve its quality of service and customer assistance."
 },
 {
  "REGULAR": "It would be very useful if Basf could have some stock and not only through orders with a delivery date of 3 months"
 },
 {
  "REGULAR": "Availability and prices in MPG and DPG"
 },
 {
  "REGULAR": "we have problems with deliveries more than 6 months ago."
 },
 {
  "REGULAR": "They do not always have enough stock at BASF Peruana"
 },
 {
  "REGULAR": "Quality is important but the rigidity of the credit bureaucracy does not help to generate a more fluid trust, especially with clients with several years of commercial relationship where they should, days but days less, in the deadlines to lock an order."
 },
 {
  "REGULAR": "They handle a wide portfolio of products"
 },
 {
  "REGULAR": "The prices are good and the quality of the products as well. But they are not reliable in delivery times."
 },
 {
  "REGULAR": "Price \/ quality, Today there is a lot of competition and although basf is excellent quality, today more competitiveness is needed"
 },
 {
  "REGULAR": "Little contact with the contract administrator"
 },
 {
  "REGULAR": "In Product quality, excellent.\n In Customer Service, there is a lot to improve."
 },
 {
  "REGULAR": "Their products are excellent, even their attention is quite good under the circumstances, there are areas to improve such as;\n a) slow execution of the agreed projects\n b) attitude of avoiding the formalization of the agreements by BASF\n c) when items from different business units are purchased, the service declines"
 },
 {
  "REGULAR": "Quality Products"
 },
 {
  "REGULAR": "It is a great company with a lot of technical support, but the southern cone is a bit relegated"
 },
 {
  "REGULAR": "It is not the most agile company and in the products we require, it is usually difficult to receive a real interest in selling us. There are always availability problems or it seems that our market is not of interest to BASF."
 },
 {
  "REGULAR": "It is a good supplier, they usually meet the delivery dates"
 },
 {
  "REGULAR": "By product quality"
 },
 {
  "REGULAR": "I have recommended to several, but everything goes through price issues. And even more so where there is a free zone region, I write to you from my region,\n Arica Parinacota. That we are inserted in this area, where it is impossible to compete\n With prices given in the Metropolitan region."
 },
 {
  "REGULAR": "Good service, lack of proactivity in bringing innovative solutions."
 },
 {
  "REGULAR": "Distancing."
 },
 {
  "REGULAR": "A lot of bureaucracy in the solution of pending issues"
 },
 {
  "REGULAR": "The reasons are the difficulties in aligning the prices of BASF products with other resellers in the operating region, little support from the regional manager and an RTV that leaves much to be desired for our needs."
 },
 {
  "REGULAR": "The company is very stuck in its internal processes and is not concerned with understanding the customer's mind."
 },
 {
  "REGULAR": "Products have quality and present satisfactory results. However, the need for asset rotation required handling with other products from other companies"
 },
 {
  "REGULAR": "FOR THE QUALITY OF ITS PRODUCTS"
 },
 {
  "REGULAR": "most of the time there are products\/solutions for my need. But I currently miss good front-line coaches"
 },
 {
  "REGULAR": "Good quality in the products."
 },
 {
  "REGULAR": "Excellent chemicals and products, but have difficulties in understanding the demands of some sectors and change products and data without prior interaction with customers who use the products in their processes."
 },
 {
  "REGULAR": "Past problems with late delivery"
 },
 {
  "REGULAR": "Price dispersion at the tip\n Distancing of the basf\/channel relationship\n Privileges one channel only"
 },
 {
  "REGULAR": "for the excellent quality of its products."
 },
 {
  "REGULAR": "Slow dispatches from suppliers, bad import scheduling, shortages of products in times of high demand."
 },
 {
  "REGULAR": "Basf's service and presence in the area have improved considerably. The only factor to improve is the availability of stock of some products in which the opportunity to sell them was lost because they were not available, such as Elmus for example."
 },
 {
  "REGULAR": "It depends on the business area. In some of them, the answer is late or there is simply no answer. When asked for availability or price expectations, they will most likely say: \"I don't know, I don't have information.\""
 },
 {
  "REGULAR": "Lately there has been less accurate information"
 },
 {
  "REGULAR": "The fact that the company is very departmentalized makes contact difficult and, in many cases, not even the employees themselves know who is responsible for certain products.\n The company adopts a clique policy, favoring some distributors and ignoring new players, thereby failing to generate new business and opportunities.\n The impression is that we have to beg to buy from BASF."
 },
 {
  "REGULAR": "We had business problems that undermined the trustworthiness of the relationship."
 },
 {
  "REGULAR": "Because the prices are the highest in the market"
 },
 {
  "REGULAR": "I deal with business through its represented KEMIOK, and, in recent dispatches I have felt a lot of delay in the matter of verifying accounts for balances, I do not know if it is because they do not give timely follow-up or because the process is slow at the BASF headquarters. Quite apart from this, the cost of the product they offer us is high, and the payment conditions have not changed, not even for the time we have been with you as business associates."
 },
 {
  "REGULAR": "I would recommend it to large companies only as small ones are not the focus of BASF and therefore its low flexibility does not accommodate smaller clients."
 },
 {
  "REGULAR": "Stable company"
 },
 {
  "REGULAR": "The quality \/ cost ratio must be evaluated in detail."
 },
 {
  "REGULAR": "Their products are good in tailings applications, and they also see after marker"
 },
 {
  "REGULAR": "Good level of technical response, but not very flexible when adapting to the specific needs of our product"
 },
 {
  "REGULAR": "The score refers to the entire Basf context, therefore it is not only technical"
 },
 {
  "REGULAR": "good service"
 },
 {
  "REGULAR": "It is a reliable company in terms of support and backing for being so large, however, personally with rejection issues, there has been a lot of delay in definitions, which impacts production processes."
 },
 {
  "REGULAR": "The products are of quality, the supply difficulties are improving"
 },
 {
  "REGULAR": "changes in the market and the limited technical structure of customer support"
 },
 {
  "REGULAR": "They are sellers of commodities. They do not differentiate large clients from small clients.\n The price scales play against the large users and the sellers in order to sell 200 kg more destroy the market.\n They say that nobody represents them in the country and local companies use the BASF LOGO to say that their products carry their brand and we see that they import the same raw material from China !!!"
 },
 {
  "REGULAR": "Feed back from technical and commercial areas coincide in an uncomfortable and stressful relationship.\n Although technically it is an impeccable company and it has always responded in this regard."
 },
 {
  "REGULAR": "For the modification of its marketing policy."
 },
 {
  "REGULAR": "Basf, is a responsible company in its products, quality and well positioned in the local market, we regret that they do not have cylinder presentations, but above all we have confidence in the products they sell."
 },
 {
  "REGULAR": "The company has excellent products; but there is no performance in the operations - there is a lack of agility \/ organization that the sector needs.\n I work as a Purchasing Manager in a distribution channel, whenever I buy there is difficulty in receiving orders (from 8 to 60 days). We have already had confirmed shipments that never arrived and returned saying that we refused, which never happened. Today is 9\/29\/2020 and we did not receive products invoiced by BASF on 9\/18\/2020! The company should review its logistics partners and processes. We receive products with different prices for orders; products with change of packaging or shipping location without order adjustment (impacting price divergence). It is frustrating to buy and wait for the order to adjust the system, as well as adjust and at the time of receipt there is a discrepancy; it generates rework and a lot of wasted time.\n My opinion is based on comparison with BASF's major competitors in the agribusiness sector.\n I hope I helped, that's the goal."
 },
 {
  "REGULAR": "Unstable logistics and sourcing"
 },
 {
  "REGULAR": "good, the company BASF is an organization that has had important changes at a structural level for the benefit of customers, profitable and attractive benefits, the only limitation is that its product palette is an old palette where innovation is not present today, we have Of course, it is not something caused by you but by regulatory limitations of the country."
 },
 {
  "REGULAR": "Sometimes the processes are very slow"
 },
 {
  "REGULAR": "The market recognizes the quality of technologies worked by BASF in the agricultural sector, but this brand is being threatened by the lack of active in the company's main products."
 },
 {
  "REGULAR": "In recent years, the distribution of Basf products has ceased to be attractive due to the fact that there is a lot of supply in the market and a deterioration in the margin.\n Despite being my biggest supplier, with a huge distance from competitors, it is not delivering margin."
 },
 {
  "REGULAR": "Undeniable quality. Products are not discussed. The score is not high, due to delayed bureaucratic processes, low execution of action plans, reactive and not proactive."
 },
 {
  "REGULAR": "Quality Products. Questionable sales policy in the last 3 years. Distributors lose interest in wearing the brand on their uniform."
 },
 {
  "REGULAR": "They have good products and good strategies, but their processes do not help and their policy is very rigid"
 },
 {
  "REGULAR": "Basf is a company with good products, but in recent years it has been slow in product innovations and at a commercial level it is perceived as very focused on access to the field and is not protecting traditional marketers."
 },
 {
  "REGULAR": "It responds to the fact that in product quality the score would be 10, while in technical services it is 4 and in responses to various requests it is 6. If BASF takes up the technical aspects and the integration of its team to the field reality, the score would be between 9 and 10, the last two aspects are affecting the high quality of BASF products."
 },
 {
  "REGULAR": "Lack of support from Basf in commercial strategies and extreme difficulty in maintaining a transparent partnership."
 },
 {
  "REGULAR": "Because of having to work with very low margins that my business cannot support"
 },
 {
  "REGULAR": "unfair competition selling generics as original, making prices unfair for us who work 100% suvinil."
 },
 {
  "REGULAR": "From my position as CFO I would not know how I could recommend BASF to a friend or colleague."
 },
 {
  "REGULAR": "The company has high quality products. Prices are also interesting, but the margin leaves something to be desired. I can't compete in big sales either"
 },
 {
  "REGULAR": "LACK OF PRICE POLICY AMONG RESELLERS."
 },
 {
  "REGULAR": "Products and brand with great visualization, but the company is still very plastered with regard to the dissemination of material at the Point of Sale and lack of flexible payment terms. Since in the present moment in which we live, it would be a great optimization tool"
 },
 {
  "REGULAR": "Good quality of products and competitive prices"
 },
 {
  "REGULAR": "The service is good but I think delivery times could be improved."
 },
 {
  "REGULAR": "Personally, I think they are inflexible and customer service is deficient, I feel that you cannot be accessed. Lack of presence."
 },
 {
  "REGULAR": "Delay in returning the requested information.\n Lack of clarity regarding internal processes."
 },
 {
  "REGULAR": "Difficulty in direct service and lot size."
 },
 {
  "REGULAR": "Very long lead times"
 },
 {
  "REGULAR": "I worked at BASF for 15 years. I know the virtues and not so many of the company.\n I keep the best memories of having had the opportunity for professional growth and the most important of having a source that allowed me to be the breadwinner."
 },
 {
  "REGULAR": "More speed is needed when making requests."
 },
 {
  "REGULAR": "we have had latex deliveries without meeting quality standards. The error was recently acknowledged after sending samples to an external laboratory."
 },
 {
  "REGULAR": "BASF products have an undeniable quality, however, the company's system lacks the response time to any request - especially in the quality and import sectors -, which hinders the input distribution process.\n Also, the company still needs to adapt to national legislation and bureaucratic systems established by bodies such as ANVISA and MAPA, meeting the document requirements required by the entities."
 },
 {
  "REGULAR": "Demand service."
 },
 {
  "REGULAR": "Delay in confirming shipments and constant delay in relation to the requested delivery date, even when the order is placed well in advance."
 },
 {
  "REGULAR": "Product delivery logistics are poor."
 },
 {
  "REGULAR": "It has very good products, but they are very disorganized, so it is difficult to give a high score."
 },
 {
  "REGULAR": "The size of the company does not allow it to easily and quickly reach customers with all the real opportunities it could provide to generate value for customers. Smaller and fewer companies"
 },
 {
  "REGULAR": "I believe that the company offers a very good portfolio and product quality with a great regional coverage and is a very well structured company, it is not a 10 because it is not so flexible on some occasions with client requests."
 },
 {
  "REGULAR": "We have BASF as a partner for 40 years, I see a lot of difficulties in negotiating. The distributor that serves smaller stores, makes sales conditions that we are not able to make the price. These sales outlets only use SUVINIL to make other sales from other brands."
 },
 {
  "REGULAR": "It is a good company."
 },
 {
  "REGULAR": "The score was not higher, due to the lack of current MP (MDI), being provided below the historical average and some logistical problems in the year."
 },
 {
  "REGULAR": "It is necessary, an adjustment of focus in the development of new projects, hitting the target, I observe a certain elitization, in dealing with clients, where those who make it happen are not heard, only higher hierarchical levels."
 },
 {
  "REGULAR": "BASF has technology, but the price is higher, it's a decision that needs to be put in the balance."
 },
 {
  "REGULAR": "Very expensive products in relation to the market and lack of products."
 },
 {
  "REGULAR": "Solid company, good products but looking for more creativity in business"
 },
 {
  "REGULAR": "PQ LEAVES DESIRING ABOUT SOME INFORMATION ABOUT THE INK"
 },
 {
  "REGULAR": "- Eliminate financial cost of installment 60\/75\/90\n - Improve payment terms to 60\/90\/120 without vendor\n - Improve delivery logistics, broken products"
 },
 {
  "REGULAR": "It is a company that presents quality products, but with regular price competitiveness.\n With the recent problems (second in a short period) of vitamin A, there is a concern with the contingency plan that the company has in cases of force majeure and also with security."
 },
 {
  "REGULAR": "Excellent products but very slow response to the customer. In addition to a very high turnover. From the commercial team"
 },
 {
  "REGULAR": "We have been 3 consecutive years where they leave us stranded with assembled orders almost 6 months in advance."
 },
 {
  "REGULAR": "Good relationship with customers"
 },
 {
  "REGULAR": "They have to improve delivery times and hopefully keep more products in place."
 },
 {
  "REGULAR": "Quick response to requests, always willing to help, quality products\n Improving attention to deadlines. In our last catalytic converter purchase, a part of it was ready in the nick of time, being necessary to come by plane and with a large amount of broken catalytic converter."
 },
 {
  "REGULAR": "is a company that contributes in cutting-edge technology, it serves to be up to date in innovation"
 },
 {
  "REGULAR": "Noy local production"
 },
 {
  "REGULAR": "Support is required on technical issues."
 },
 {
  "REGULAR": "We have had problems with the product that, although not serious, do not allow us to work with it with confidence. Beyond that the position of the seller was always proactive and cooperative with us, it was not possible to advance to a point of total stability. And on the other hand, the delivery service in terms of meeting requested and confirmed dates always suffers significant delays, which limits the possibility of purchasing a larger volume."
 },
 {
  "REGULAR": "good quality of products but little flexibility and adaptation to the local market."
 },
 {
  "REGULAR": "In my opinion, there is a lack of flexibility, the internal processes are long in order to give an agile response to the client, greater deployment to clients in innovative products, improve competitiveness"
 },
 {
  "REGULAR": "It has a very good technical backing.\n The cancellation is the communication in case of dispatch problems or product alternatives."
 },
 {
  "REGULAR": "We still use very little to get a more conceptual idea. We would need to have a higher volume of use to get a better idea"
 },
 {
  "REGULAR": "The availability of the products in a timely manner are extremely important in these times, that is the point to improve."
 },
 {
  "REGULAR": "THE PRODUCTS ARE GOOD, THE MARKETING IS NOT SO MUCH. THE INTERESTS FOR MORA USURERS."
 },
 {
  "REGULAR": "BASF has great products, but an impossible financial policy for an SME.\n It generates ND without mediating the damages it causes, in some cases with usurious interests.\n The commercial sector always responds very well."
 },
 {
  "REGULAR": "The attention that I have had from the executives has been good but the service is slow in the quotes, in the sending of samples and in the shipments."
 },
 {
  "REGULAR": "It is a good company, with good products."
 },
 {
  "REGULAR": "We have not been able to reestablish communication and business that we did for some time"
 },
 {
  "REGULAR": "In my sector, which is Agro, they have a commercial policy that promotes a price war among their distributors, for which the margins deteriorate seriously."
 },
 {
  "REGULAR": "Very rigid policies and very low margins"
 },
 {
  "REGULAR": "No contact of the leadership team with important clients\n Concentration of actions & decisions in central offices; but they DO NOT make any decisions to support business continuity\n Very far from the market - they have no idea what is happening in the Distribution Channel, much less with the Farmers"
 },
 {
  "REGULAR": "They are not clear on discounts for promotions"
 },
 {
  "REGULAR": "Commercial terms"
 },
 {
  "REGULAR": "has good quality products"
 },
 {
  "REGULAR": "They fail in communication and customer service.\n They fail to supply products."
 },
 {
  "REGULAR": "The recommendation does not depend solely on a unilateral decision, it has other condiments that include the situation of the friend \/ colleague, their intentions and their location in the context.\n Example if it were to work in Basf it would be a 10. If it were to work with Basf they enter to validate the other condiments"
 },
 {
  "REGULAR": "Slowness in offices"
 },
 {
  "REGULAR": "They only contact us when we require product"
 },
 {
  "REGULAR": "Delivery times are very slow and they have no product when we need them."
 },
 {
  "REGULAR": "The line has lost the profitability expected for a portfolio of specialties"
 },
 {
  "REGULAR": "There is still work to be done to achieve not only the focus on Sell In, but also to seek a collaborative approach on Sell Out and fair Trading Conditions in the market."
 },
 {
  "REGULAR": "Because it is very good"
 },
 {
  "REGULAR": "Its large size as an organization makes it inflexible and slow to react."
 },
 {
  "REGULAR": "good products"
 },
 {
  "REGULAR": "We did an activity called \"TEAR DOWN\" to survey ideas and proposals where BASF participated, on the occasion BASF proposed several ideas but there was no continuity of these studies. As BASF has a very qualified technical team, we understand that we have lost the opportunity to increase business."
 },
 {
  "REGULAR": "The quality of BASF is a favorable point, they should work on the competitiveness of commercial offers."
 },
 {
  "REGULAR": "I have no comments"
 },
 {
  "REGULAR": "For the quality and guarantee of the products\n For the good attention of its collaborators"
 },
 {
  "REGULAR": "In order to access competitive conditions, I have to buy things in volumes that I do not want or things that do not interest me so much, whether in packages or individual products such as soybeans."
 },
 {
  "REGULAR": "The price level and payment term in the negotiations is reduced."
 },
 {
  "REGULAR": "Good service, but needs greater clarity in the negotiations,"
 },
 {
  "REGULAR": "recommendation"
 },
 {
  "REGULAR": "My decision is based on the moment we live in, at another time my indication would be 10"
 },
 {
  "REGULAR": "Today, the price and margin standards practiced in our region, concomitantly with the pressure for inventories, I am not comfortable in recommending Basf fully to a storekeeper friend."
 },
 {
  "REGULAR": "For the points mentioned above."
 },
 {
  "REGULAR": "They demand very high liters and even in this pandemic that we are living they didn't make it easy for the logistician."
 },
 {
  "REGULAR": "Good service, but we do not always obtain the certificates of the purchased raw materials and the person we contact always refers us to the web."
 },
 {
  "REGULAR": "Long delivery time, and with delays."
 },
 {
  "REGULAR": "BASF has a robust structure (production \/ laboratories) and has competent people."
 },
 {
  "REGULAR": "Basf usually respects agreed delivery dates and has an acceptable response time for inquiries"
 },
 {
  "REGULAR": "- Inflexible logistics\n - Continuous missing\n - Quick response from the commercial sector"
 },
 {
  "REGULAR": "Trust issues."
 },
 {
  "REGULAR": "the Product is very good but very expensive"
 },
 {
  "REGULAR": "BY THE MANAGEMENT OF THE PREVIOUS SELLER ..."
 },
 {
  "REGULAR": "It has a wide palette of products. excellent formulations good presentation of clear containers on their labels. good technical support in the field or if you have any questions, they respond as soon as possible."
 },
 {
  "REGULAR": "the company has a good portfolio, but it lacks the logistics and strategy for HF"
 },
 {
  "REGULAR": "good products and warranty"
 },
 {
  "REGULAR": "Good performance products"
 },
 {
  "REGULAR": "They are good products, but to get good discounts the volumes are very high"
 },
 {
  "REGULAR": "attractiveness level"
 },
 {
  "REGULAR": "Product availability, response time to complaints or concerns is not good"
 },
 {
  "REGULAR": "BASF known worldwide for the quality of its products, but it has many drawbacks in terms of packaging, labeling, regulatory information. Labeling problems constantly arise, the same ones that remain; momentary solutions are implemented, such as putting film around the label to prevent detachment, lowering its quality and presentation, putting the product into question.\n Necessary and definitive action needs to be taken for recurring presentation, labeling and technical label information problems."
 },
 {
  "REGULAR": "It has good products and its people are educated and know a lot. In some materials their materials are expensive."
 },
 {
  "REGULAR": "Basf is a large company that can serve Tier 2 and 3 customers. It has active technology and development area, and for this reason I would recommend them."
 },
 {
  "REGULAR": "Very extensive development loops. Low reactivity to problems"
 },
 {
  "REGULAR": "Product quality and experience"
 },
 {
  "REGULAR": "Excellent quality of commercials, but at the moment with big problems in the performance of your product."
 },
 {
  "REGULAR": "Extremely reliable company in its products"
 },
 {
  "REGULAR": "Product with a lot of acceptance in the market of my region"
 },
 {
  "REGULAR": "I could list the following qualities: seriousness, product quality, team training. On the other hand, the following points to be improved: logistics, understanding of the client's business and respect for it."
 },
 {
  "REGULAR": "Sales policy, price war for the same product, purchased from different channels (retailer with distribution). Unfair competition between resellers of the same brand (Suvinil\/Suvinil and not between Suvinil\/Coral)."
 },
 {
  "REGULAR": "Quality Issues in Granite Crystall FCA"
 },
 {
  "REGULAR": "We know the quality of Basf's product, however, the low availability and constant changes in the schedule make inventory scheduling very difficult."
 },
 {
  "REGULAR": "The type of material we buy at BASF is not meant to be indicated to anyone, and we would never like BASF to offer the same type of material to a competitor as ours, this could affect the customer \/ supplier relationship."
 },
 {
  "REGULAR": "It is a very good company, but they fail a lot in service and quality"
 },
 {
  "REGULAR": "In terms of quality, BASF products meet very demanding standards. However, the life time of the product is also evaluated in comparison to its similar; in this case, BASF does not revalidate products or issue shelf life extension letters, for this reason it will be very difficult for the distributor to face such a scenario."
 },
 {
  "REGULAR": "THE INVASION OF AREA WITH PRICE PROSTITUTION, PROMOTED AND SPONSORED....\n QDO. THERE IS PERMISSION FOR ANOTHER CHANNEL, THIS SELLER CONTRACTS HERE TO ACCESS THE SAME CUSTOMERS WE SERVED FOR YEARS;\n SELL AT LOWER PRICES Q. OUR PURCHASE PRICE AND THE MOST SERIOUS:\n \"DISAPPEAR, NOT GIVING ASSISTANCE; LETTING THE CUSTOMER APPLY IN ANY WAY RESULTING IN INEFFICIENT CONTROL\" (BURNING BASF PRODUCTS)\n ***DO NEW CUSTOMERS ACCESS? NO.\n ***MARKET SHARE OF BASF PRODUCTS? THE SAME..."
 },
 {
  "REGULAR": "Renowned company, quality products and committed to society's well-being.\n We expected to be more important than we are treated"
 },
 {
  "REGULAR": "The grade could be better, but currently there is an excess of Basf supply in the market. Many channels in the same area, especially cooperatives."
 },
 {
  "REGULAR": "Lack of transparency, organization and turnover of people"
 },
 {
  "REGULAR": "Cutting-edge products,\n Defects, poor service, it takes time to solve a problem and logistics doesn't work"
 },
 {
  "REGULAR": "Company with good prices and portfolio"
 },
 {
  "REGULAR": "Although I am \"called\" an ELO Customer by the Company, I was not given any credit for doing business, despite a very old History within the Company.\n\n There seems to be an incompatibility between the Commercial (which calls me ELO, knows my History), and the Financial, which did not take this History into consideration just because I am not the holder of the Rural Producer IE for a few decades of relationship!! !"
 },
 {
  "REGULAR": "I believe that Basf has to improve the speed of solving quality problems and provide faster solutions for them. In 2019, we had serious quality problems and BASF's posture, in general, was not satisfactory, both in terms of the speed of resolution and in terms of dealing with the problem. They need to improve this approach."
 },
 {
  "REGULAR": "They have very good products, with adequate technical specifications, permanent and very fast advice regarding the functionality of the products. I do not put more qualification due to the attention of customer care in logistics"
 },
 {
  "REGULAR": "I rated it 6 because in my opinion BASF lacks paying more attention to its smaller customers, as I suffer a lot of pressure from BASF managers and consultants when I do a promotion or lower the price of my products for sale, I have already suffered threats to increase my purchase price, which I think has already happened, as BASF's biggest customers in recent months are offering some SUVINIL products almost equal to my cost price, and deposits of construction materials that are not even specialized only in paint and buy of the distribution, they are managing to offer SUVINIL products well below mine, and I have complained several times to my consultant, and he tells me that he will look and resolve, but has not resolved. I have 2 stores, one in Paraopeba which is in the Central region of Minas, 100km from BH and the other store is in Varzea da Palma in the North region of Minas, they are different regions and I think there should be different consultants, because my consultant who is from the northern region of minas is not able to serve me well here in Paraopeba, I am not having the necessary assistance, because so many of my competitors with purchasing power much higher than mine and competitors with purchasing power much lower than mine are managing to offer their products in a way that I can't compete, it's getting complicated to work this way. I had plans to open another branch, but due to the lack of assistance and the difficulties they are encountering, I find it impracticable to try to work in another store with Suvinil. In 8 years in the store I have never been so difficult to sell my product, because BASF requires a lot of goals, I try to beat them all, but the goals are very exaggerated and hard to beat, because I have bought too much product, no need to hit the goal and they are not managing to sell much, because the competition is offering their products almost equal to my purchase price."
 },
 {
  "REGULAR": "BEST TRADING CONDITION TO MONITORING THE MARKET"
 },
 {
  "REGULAR": "The products generate reliability within the Colombian market, however, the production and logistics times are not competitive.-\n Thank you"
 },
 {
  "REGULAR": "Due to permanent product changes without maintaining a stable and coherent line with what this implies in the economic variables."
 },
 {
  "REGULAR": "The products are of good quality but the time it takes to have a sample is too long."
 },
 {
  "REGULAR": "It is a reliable company and its products are of good quality."
 },
 {
  "REGULAR": "COMPANY HAS GOOD PRODUCTS AND GREAT CUSTOMER SERVICE SERVICE, BUT LEAVE WISHING IN COMMERCIAL POLICY AND LOGISTICS"
 },
 {
  "REGULAR": "Not all business units are the same, they do not provide the same support. Some disorganization is perceived."
 },
 {
  "REGULAR": "It has a wide portfolio and very good quality, but the price is not competitive."
 },
 {
  "REGULAR": "Due to the reliability and quality of the products. However, flexibility in service and availability is very low."
 },
 {
  "REGULAR": "BASF has been constantly withdrawing products from the line, and the deadline for customers of these products to receive action is extremely short.\n Knowing that many of these components are in OEM formulations, care in this issue should be differentiated.\n It is difficult to recommend BASF with this kind of arrogance."
 },
 {
  "REGULAR": "Good products, good service"
 },
 {
  "REGULAR": "Basf is sinning a lot in its relationship with channels"
 },
 {
  "REGULAR": "For product application safety"
 },
 {
  "REGULAR": "due to the degree of demands in the partnership !!!"
 },
 {
  "REGULAR": "quality, service"
 },
 {
  "REGULAR": "It is a great brand with excellent solutions."
 },
 {
  "REGULAR": "Business transparency"
 },
 {
  "REGULAR": "the negotiations are very stressful, as a large basf customer we would have to have a better financial result, I don't know if it's worth all this effort to buy basf"
 },
 {
  "REGULAR": "It has good products, but with little commercial plasticity."
 },
 {
  "REGULAR": "Good prices. good products. as a negative, perhaps the deliveries coming from BsAS are delayed a bit. although they have improved a lot"
 },
 {
  "REGULAR": "Very good products but at too high prices."
 },
 {
  "REGULAR": "We have some products that would need more standardization in production, and unfortunately, that's not what we showed."
 },
 {
  "REGULAR": "at"
 },
 {
  "REGULAR": "There is inflexibility in commercial terms and I don't see much effort in evaluating opportunities across the chain that could be beneficial to both companies."
 },
 {
  "REGULAR": "difficult to place orders, personal service was much better, the marketing of pigments and concentrates via IMCD made it difficult and increased the price of products. the targeting for small companies in Brazil is bad, even though they belong to a large German group, as in our case."
 },
 {
  "REGULAR": "Basf lacks a lot of flexibility."
 },
 {
  "REGULAR": "They must considerably improve the commercial area"
 },
 {
  "REGULAR": "The quality is guaranteed, the cost can become a disadvantage."
 },
 {
  "REGULAR": "It is evolving in terms of partnership. It has always been very corporate, with no concern for partnership."
 },
 {
  "REGULAR": "good morning it seems to me that Basf does not take into account all the client's needs"
 },
 {
  "REGULAR": "The products are good, but every day its product portfolio is more limited and its logistics is complex."
 },
 {
  "REGULAR": "Shows little interest in the customer."
 },
 {
  "REGULAR": "It has an extensive portfolio and high performance products, increasing the level of reliability and robustness in the processes"
 },
 {
  "REGULAR": "The lack of technical assistance would lead me not to recommend BASF, however, the commercial service was very good."
 },
 {
  "REGULAR": "The service needs to improve in terms of innovation in support of the processes. I am still working with old methodologies that no longer provide greater value, nor do they make them different from the rest"
 },
 {
  "REGULAR": "Response time and service could be faster and more accurate."
 },
 {
  "REGULAR": "It is a quality product."
 },
 {
  "REGULAR": "there is always room for improvement"
 },
 {
  "REGULAR": "There have been situations in the company that have led us to have serious supply problems. Eg ibuprofen"
 },
 {
  "REGULAR": "The customer service is good, however it has communication failures that affect the coordination of receptions and production planning"
 },
 {
  "REGULAR": "It is a great company, but generally very slow in responding to customer needs."
 },
 {
  "REGULAR": "it takes a long time to fill orders, it fills 60, 80% of the order, complicated logistics."
 },
 {
  "REGULAR": "sss"
 },
 {
  "REGULAR": "Quality"
 },
 {
  "REGULAR": "I would recommend the quality of BASF products, but not the agility of the service"
 },
 {
  "REGULAR": "Because in recent years, they have modified the strategy, without considering the most loyal strategic partners, terribly damaging our market share."
 },
 {
  "REGULAR": "Expensive prices"
 },
 {
  "REGULAR": "The products comply with quality but are outside the average price range of the market. On the other hand, supply times are quite long and there is little technical support service as regards the food sector."
 },
 {
  "REGULAR": "Very good product quality, very good customer service. Fulfillment of deliveries or availabilities, sometimes not so efficient."
 },
 {
  "REGULAR": "Absolutely proven products, high quality, and technological development. Personally, I could not put 10 for not knowing 100% of the potential of the Basf nutrition product palette."
 },
 {
  "REGULAR": "pricing policy above market prices"
 },
 {
  "REGULAR": "We have a lot of difficulty in the relationship with BASF, there is an inflexibility in the negotiations and they become extremely dependent on external decisions for local sales, where we identify a global price drop for a specific product and even so we can't manage any kind of negotiation here."
 },
 {
  "REGULAR": "It will depend on the area of influence of my friend, profile, segment."
 },
 {
  "REGULAR": "They have products of excellent quality and performance, but they are extremely inflexible commercially, especially with those that sell the most, and with the unpresentable small businesses they give very favorable conditions."
 },
 {
  "REGULAR": "Although it has a good product line, the company does not seem to focus on the agricultural business, it does not have a targeted distribution policy making any distributor focus and support at the field level to its customers (producers). It needs to be more objective, strengthening itself before its competitors and with the producer."
 },
 {
  "REGULAR": "lack of agility\n response time\n Delivery delays"
 },
 {
  "REGULAR": "quality products"
 },
 {
  "REGULAR": "They have excellent products but management and attention are very bad. They must be one of the worst companies in terms of administrative management."
 },
 {
  "REGULAR": "The paint is very good but the people who work at BASF do not give a solution to the problems, we have been waiting for a solution for months and there is no response from anyone, thank you"
 },
 {
  "REGULAR": "According to my experience, in the last time I feel that I have received the documentation after having requested it with a certain level of insistence, after them I find the service excellent."
 },
 {
  "REGULAR": "We had many problems with availability of products for delivery in previous years"
 },
 {
  "REGULAR": "They have an excellent product portfolio, but they do not adjust their business projection to the real market value or rather to the conditions of the agricultural market."
 },
 {
  "REGULAR": "Grade 7 was given. But Basf cannot turn a mestil on every corner if it is difficult, it needs to support more partners in conditions. In my region Pouso Alegre and more HF fast cycle cultures we don't even have an ATS to help us."
 },
 {
  "REGULAR": "For the support provided by BASF and predisposition."
 },
 {
  "REGULAR": "Faults in the Service of the programmed products. Lack of information as to the reason for DELAYED DELIVERIES. Need for a contact at the Managerial and\/or Board level, for faster and more concrete solutions."
 },
 {
  "REGULAR": "They still need to improve their attention to emails (faster responses) and more agile resolution of problems that usually arise."
 },
 {
  "REGULAR": "Good quality and good technical service"
 },
 {
  "REGULAR": "Good products, more communication is lacking"
 },
 {
  "REGULAR": "The Company has good products More in the Lubricants line the service is not good."
 },
 {
  "REGULAR": "Prices are not the best in the market."
 },
 {
  "REGULAR": "Portfolio, R&D, Rebate.\n Negative point: regional price unevenness."
 },
 {
  "REGULAR": "It has a good portfolio and apparently with a more adjusted commercial policy than in recent years."
 },
 {
  "REGULAR": "The technical quality of the raw materials is indisputable, as well as the documentary subsidy. However, I still realize that it is difficult to serve small companies, in the commercial aspect, with agility and conditions through the processes of a large company, such as Basf. It is necessary to adjust this parameter internally to serve smaller companies."
 },
 {
  "REGULAR": "The Atagel 50 we bought from Basf is still different from what we received in 2017 and 2018 and we are having several problems in production"
 },
 {
  "REGULAR": "The service leaves something to be desired, we have no return on requests."
 },
 {
  "REGULAR": "High quality products, but they take some time to respond to requests"
 },
 {
  "REGULAR": "Normally I would have given a 10, but during 2019 we had some quality problem that, despite being quickly resolved, disturbed us a lot. I hope they can recover my 10th grade in the coming months while maintaining the level of service and superior technical support that BASF has always delivered."
 },
 {
  "REGULAR": "Commercially, we have a fast service, but when it comes to the qualification process, that is, document evaluation, fillings and feedback, this takes a long time at BASF. Today, we basically stopped doing business with BASF for the item Pluriol A 750E, due to lack of document and return."
 },
 {
  "REGULAR": "Quality in service and products"
 },
 {
  "REGULAR": "Little flexibility with dispatches from origin, arrears."
 },
 {
  "REGULAR": "Long time in response to the request, or they do not respond."
 },
 {
  "REGULAR": "The problem of territories between distributors has not been resolved and the investment made in inventories is always at risk"
 },
 {
  "REGULAR": "In the first instance, it was difficult for them to respond to my request for a quote. Later, when they contacted me from Argentina, they told me that in Chile they could attend to me, and in Chile the answer took too long. We finally got the product in Chile."
 },
 {
  "REGULAR": "They should have a discount, even in time, not by sections, there are businesses that never manage to reach the sections,\n I buy in other companies, and the amount to buy does not matter. The same discount is always maintained,"
 },
 {
  "REGULAR": "Good products and date compliments"
 },
 {
  "REGULAR": "The attention and speed of the answers to the doubts or request for quotes is very effective."
 },
 {
  "REGULAR": "They have very volatile materials inventory availability, we don't really know what to expect month after month, and they have a very internal view of the business."
 },
 {
  "REGULAR": "have a large portfolio, but response times are not the best"
 },
 {
  "REGULAR": "Regarding the logistics area, they do not have stock, they cancel PO issued for the year without prior notice. Regarding Quality, the products arrive with wrong data."
 },
 {
  "REGULAR": "Good products, but the attention or lead times are not the most appropriate. Lack of support in market product applications"
 },
 {
  "REGULAR": "It could generate a higher score but the production Lead Time is very long and the processes of confirmation of stock availability as well."
 },
 {
  "REGULAR": "Delay in resolving calls."
 },
 {
  "REGULAR": "Goals are disproportionate. They do not align with the number of inhabitants of the city and the GDP"
 },
 {
  "REGULAR": "Suvinil has a good relationship with us, excellent products, good market penetration with its strong brand, but it is the company within our business that leaves the lowest margin result and has the worst delivery among our suppliers."
 },
 {
  "REGULAR": "high goals"
 },
 {
  "REGULAR": "I think that Suvinil would have to pay more attention to customers like Dicafer, I mean, medium-sized customers, because today only large customers are the ones who get attention, and I think that everyone is a customer, because this large one may no longer exist in the future, as these medium and small grow. I think there has to be actions such as magic moments, for smaller customers, then we would have more contact with the board, managers, in short, the customer relationship with Suvinil, today we only have the figure of the Suvinil salesperson, who serves us well, but we only got to him."
 },
 {
  "REGULAR": "as it is a credible company but with some limitations in the actions, that is, it needs to be faster in making important decisions."
 },
 {
  "REGULAR": "Inflexibility in negotiation, distrust of partners, regression in product launches."
 },
 {
  "REGULAR": "Sales policies make business transactions difficult."
 },
 {
  "REGULAR": "They have good concepts, developments and theoretical commercial technical support, however in practice the support falls a little short, since by needing to carry out instrumental tests that support the claims sought through the raw materials included in the projects."
 },
 {
  "REGULAR": "Basf customer service is not very good."
 },
 {
  "REGULAR": "Lack of visibility of the current account. Today I do not have a website to check the general status of the account."
 },
 {
  "REGULAR": "A consolidated company with many innovations, however, could present more innovations to its customers, delays in some deliveries, harming production volume."
 },
 {
  "REGULAR": "We had some difficulties with the introduction of the 580 technology and we are still making improvements in the process for adaptation, I understand that there was also a failure on the Maxion side, but my expectations were much higher. I also understand that restructurings were made at BASF and we are finding a way."
 },
 {
  "REGULAR": "Service and quality."
 },
 {
  "REGULAR": "little or no flexibility in negotiations"
 },
 {
  "REGULAR": "Difficult to proactively bring improvements and difficult to implement the process improvements we propose"
 },
 {
  "REGULAR": "Lately I've been having excessive billed price problems with divergence that take almost (or more than) two months to be corrected. This has been impacting the cost of material."
 },
 {
  "REGULAR": "Payment deadline\n TC setting"
 },
 {
  "REGULAR": "High employee turnover;\n Employees prioritize sales volume and not product development;\n We lost major negotiations with larger producers for not following the price table."
 },
 {
  "REGULAR": "They are reliable products, of excellent quality, but a response service with insufficient agility, not because of the staff that attends us, who is always efficient, but because of the bureaucratic response of the company itself."
 },
 {
  "REGULAR": "Reference company in the chemical market."
 },
 {
  "REGULAR": "Good portfolio. Very friendly seller."
 },
 {
  "REGULAR": "many companies in the market"
 },
 {
  "REGULAR": "We have little business with Basf for a deeper assessment"
 },
 {
  "REGULAR": "Serious company that fulfills its commitments."
 },
 {
  "REGULAR": "good products and service.\n High prices."
 },
 {
  "REGULAR": "Good products but not always with good technical assistance."
 },
 {
  "REGULAR": "The commercial support is positive, however the quality of the products (labels) have presented many drawbacks. Additionally, they have the lowest level of service in terms of local logistics of all our suppliers, they take much longer than the market standard."
 },
 {
  "REGULAR": "Customer service is good, however they sometimes take time to respond to requests."
 },
 {
  "REGULAR": "Very good products; regular service and prices."
 },
 {
  "REGULAR": "Bad Logistics"
 },
 {
  "REGULAR": "THIS LAST YEAR THE SERVICE AND THE RESPONSES ARE VERY SLOW."
 },
 {
  "REGULAR": "Note 7 , it is a company that has good products , is serious in recommending the field and is always close to the customer in solving problems ."
 },
 {
  "REGULAR": "basf has an excellent portfolio, but does not offer an area protection policy for its channels, there is a lot of cannibalism among distributors, the partnership could be better"
 },
 {
  "REGULAR": "Excellent products, however, lack technical assistants in the field and prices compatible with those of competitors"
 },
 {
  "REGULAR": "The products are of good quality"
 },
 {
  "REGULAR": "Mismatch and difficulty of information, access policy to Direct Selling X Distribution, Remuneration policy, distance from RTV."
 },
 {
  "REGULAR": "A solid company, however, it still lacks ethics in the pricing of its products."
 },
 {
  "REGULAR": "excellent products"
 },
 {
  "REGULAR": "Commercial attention is easier to get in customer service."
 },
 {
  "REGULAR": "Excellent technical support but with some rigidity in commercial \/ financial matters."
 },
 {
  "REGULAR": "The products are varied because they have different lines of business, in addition, they are of very good quality.\n However, the technical service can improve."
 },
 {
  "REGULAR": "I would like a faster delivery of your products"
 },
 {
  "REGULAR": "The service is good, however we see unclear the volumes and prices of their products in the market."
 },
 {
  "REGULAR": "Product of excellent quality, but placement on insufficient ground."
 },
 {
  "REGULAR": "Good products,\n and basfontheroad presence"
 },
 {
  "REGULAR": "Quality Products"
 },
 {
  "REGULAR": "Excellent quality products.\n It is necessary to improve aspects of logistics in dispatch."
 },
 {
  "REGULAR": "good products, lousy logistics, it is difficult to trust that it will arrive on time"
 },
 {
  "REGULAR": "for 100% reliable quality, good technical assistance from your work team."
 },
 {
  "REGULAR": "MANY PROBLEMS"
 },
 {
  "REGULAR": "They have good products. However, we have had problems when continuing the business with a client. Competing directly with BASF."
 },
 {
  "REGULAR": "Technical assistance ok.\n Regarding the availability of deliveries, we have had a very tight stock due to lack of it, due to a commercial issue."
 },
 {
  "REGULAR": "They are not always very expeditious in resolving disputes"
 },
 {
  "REGULAR": "Excellent products"
 },
 {
  "REGULAR": "Response time has increased a lot... both from the commercial part and from the technical part and quality.\n For emergency care and supply it is satisfactory."
 },
 {
  "REGULAR": "Because for more than a year the responses to inquiries and services have improved a lot."
 },
 {
  "REGULAR": "(punctuation is bad punctuated !!)\n\n Very good products. Service must improve"
 },
 {
  "REGULAR": "Brand of supplies and proven efficiency."
 },
 {
  "REGULAR": "BASF products are very good for their quality. However, they are TOO expensive compared to other brands that are of the same BASF quality. I think BASF is not being realistic with the reality of the market. On the other hand, there are now a number of generics on the market that are as good as the brands that BASF represents. BASF must adjust its prices to something more realistic, they are well above the market."
 },
 {
  "REGULAR": "efficiency"
 },
 {
  "REGULAR": "Good communication and transparent."
 },
 {
  "REGULAR": "I think there are points that could be improved"
 },
 {
  "REGULAR": "Well, in terms of logistics, the company still needs to improve."
 },
 {
  "REGULAR": "difficulties in negotiating prices and targets that force high inventories, regardless of the turnover of the merchandise."
 },
 {
  "REGULAR": "suitable brand - strong partnership - well-accepted brand in the market - the problem of the low margin that leaves ..."
 },
 {
  "REGULAR": "Although Suvinil has excellent products. The profitability of Suvinil products is very low due to great competition in the market."
 },
 {
  "REGULAR": "At the moment I don't know the entirety of Basf's portfolio, but I know the quality of the company."
 },
 {
  "REGULAR": "The quality of the products justifies the recommendation, but the customer support, the prices with discrepant variations and the lack of response in several support areas justify the low recommendation score."
 },
 {
  "REGULAR": "BASF has excellent material, but with ridiculous technical assistance."
 },
 {
  "REGULAR": "The BASF company recognized worldwide with high quality products, in logistics processes, response times, recall, regulatory, has shortcomings that affect its commercialization and negotiations."
 },
 {
  "REGULAR": "Positive: High quality and performance products.\n Negative: high prices, very high minimum purchase, complex communication channels."
 },
 {
  "REGULAR": "It has product availability, it is an advantage that they send us from the USA, since for emergencies the product can be obtained earlier"
 },
 {
  "REGULAR": "Tangled commercial programs and you need to be monitoring very punctually ¡¡¡"
 },
 {
  "REGULAR": "As a company with the portfolio it has it is considered very good, but with policies for resale without standard."
 },
 {
  "REGULAR": "Broad portfolio with strategic products for crop management. On the other hand, it maintains a pricing policy that is not consistent with the market and is sometimes not plausible. Difficulty delivering the negotiated products."
 },
 {
  "REGULAR": "Great products, trade policy is missing; margin for resellers and respect for the areas of expertise."
 },
 {
  "REGULAR": "Given that the demand for the product at the local level is relatively low, it is understood that we do not have a permanent representation. This contributes to a rating that you can improve."
 },
 {
  "REGULAR": "A large product and company, however, finds it difficult to develop custom products"
 },
 {
  "REGULAR": "It has an excellent portfolio, with good development in the field, but a heavy structure for decision making, slow in liquidation of programs and bonuses"
 },
 {
  "REGULAR": "It is a risk business"
 },
 {
  "REGULAR": "Delay in email responses, some late deliveries and lack of information in case of delays"
 },
 {
  "REGULAR": "Variety of products."
 },
 {
  "REGULAR": "Little flexibility in the face of temporary changes."
 },
 {
  "REGULAR": "Good products. Service to improve"
 },
 {
  "REGULAR": "IT HAS GOOD PRODUCTS, BUT THE PRICES ARE ABOVE THE COMPETITORS"
 },
 {
  "REGULAR": "Due to the slowness that it is at the moment, delaying in billing, there is no RTV in the region"
 },
 {
  "REGULAR": "A company whose products in its portfolio have a price dispersion that borders on outrage. Differences for the SAME TYPE OF BUSINESS that easily exceed 15%. The BRL 100.00 bill from the South is worth less than the BRL 100.00 bill from the Midwest"
 },
 {
  "REGULAR": "GOOD PRODUCTS\n LOW COMMERCIAL AND POSITIONING FLEXIBILITY"
 },
 {
  "REGULAR": "Serious company, good products, good people.\n Portfolio a little scarce in some areas. Distribution channel too large. There is a lot of competition between the same \"BASF\""
 },
 {
  "REGULAR": "Depending on the sector, they respond in an agile and fast way (additives for plastics and Lubricants), but on the other hand, in the home care sector, they take a long time to respond-\n\n On the other hand, we consider that the products are of high quality, but in many cases it is difficult to confirm availability at origin."
 },
 {
  "REGULAR": "they give me security"
 },
 {
  "REGULAR": "BASF is a great company but it lacks Blood"
 },
 {
  "REGULAR": "Very good company, with a commitment, not very clear in Argentina"
 },
 {
  "REGULAR": "Regarding the line products, they are of excellence. In terms of technological innovation and the opening of new raw materials according to the rotation and adaptation of the market, they are quite relegated."
 },
 {
  "REGULAR": "The result of this last year has been very bad in terms of quality and the alternatives provided by BASF for correcting them are not giving the desired results."
 },
 {
  "REGULAR": "Commercial Economic Relations."
 },
 {
  "REGULAR": "Prices are not very competitive and commercial service has only started to improve this year."
 },
 {
  "REGULAR": "When campaigns are carried out with the company I work for, no problem, but if not, we are always out of the market."
 },
 {
  "REGULAR": "I work with sugar cane in Nova Independência - SP, Pedra Agroindustrial group, and I think that the service is flawed, as the RTV that is responsible for serving the Matrix is the same that serves us, with a distance of 450 km between the units. Another point is that the herbicide portfolio is reduced.\n However, the insecticide part is excellent, as well as the fungicide part."
 },
 {
  "REGULAR": "In my point of view, the company is not round, several companies complaining about lack of product and logistical problems, it takes a long time to come out with ai Bayer campaign and Syngenta takes the market, prices are not competitive, distance from RTV, in my case, we have branch in 3 states, RTV is in São Paulo, what is the chance of serving GO and TO, None. This new system of placing one RTV per channel sucks, prices are unadjusted by region and we are totally without support (I'm not taking into account telephones, but technical visits). To have a base, it must be more than 1 year since the BASF RTV does not sit down with my team to have a conversation, and I don't blame him because he lives in Sp, I blame BASF for the lack of preparation, therefore BASF every year there is less revenue at the store, the only reason it hasn't gone down to zero is because I didn't want to put another company that has good fungicides like CORTEVA."
 },
 {
  "REGULAR": "COMMERCIAL ISSUES AND PRODUCT AVAILABILITY"
 },
 {
  "REGULAR": "Basf is a company, which is helping with Resellers, placing goals above reality, where to obtain the goals in some cases, we are selling at prices below costs and To follow the market we are working most of the portfolio without margin.. ."
 },
 {
  "REGULAR": "Many channels offer Basf products, causing huge cannibalism in the market."
 },
 {
  "REGULAR": "The marketing policy that BASF practices in the field has drastically reduced the net result of sales operations for its products year after year.\n My recommendation is average because I see that this policy shows no signs of being reversed, that is, each year the distributor will lose more space and will no longer earn enough to remain in the market"
 },
 {
  "REGULAR": "Serious company, with good products, in terms of warehouse supply when the product is not there, I must admit that the supply of purchase orders is slow compared to other chemicals"
 },
 {
  "REGULAR": "little performance in the regional Camda Penápolis."
 },
 {
  "REGULAR": "because in my region we still don't have basf support and we didn't receive any visit from rtv, since luciana and at junior came and we managed to place products in the branch! because we were 2 years without products !!!"
 },
 {
  "REGULAR": "A long story"
 },
 {
  "REGULAR": "Delay in delivery of products\n Incomplete dispatch, missing materials"
 },
 {
  "REGULAR": "Little product renewal"
 },
 {
  "REGULAR": "cost x benefit"
 },
 {
  "REGULAR": "Excellent products, however \"allocation\" is complex.\n\n Petrizzio is a Laboratory that sells in retail, which we all know how it is, Basf is too rigid with payment dates, which is not consistent with our market."
 },
 {
  "REGULAR": "There is compliance in the quantities and the prices in some lines are competitive, but in the logistics issues that imply arrival dates and level of service to be agile between the arrival of the ships and the delivery to the customer must improve."
 },
 {
  "REGULAR": "Due to delivery problems on time."
 },
 {
  "REGULAR": "the products are good but the issue of production costs in some products are more expensive than the competition"
 },
 {
  "REGULAR": "Products, Services and network."
 },
 {
  "REGULAR": "For some time now, I feel your company is quite distant from us as a distributor, although it is true that the relationship with Erika is very cordial, we do not have only a transactional relationship today and there are no long-term or joint work plans."
 },
 {
  "REGULAR": "Lack of special prices for volumes, and support in the field."
 },
 {
  "REGULAR": "Field service, commercial conditions"
 },
 {
  "REGULAR": "It can always improve. Especially on the issue of price"
 },
 {
  "REGULAR": "Delivery is very slow\n SW is much more efficient."
 },
 {
  "REGULAR": "Great quality in the products, great demand in the resale, but it leaves very little margin for the business, even for being a market leader, it attracts very aggressive competition to the retailers."
 },
 {
  "REGULAR": "I have a lot of difficulty working with Basf-Suvinil, due to low profitability and lack of agility in several aspects on the part of Basf."
 },
 {
  "REGULAR": "Sales price policy."
 },
 {
  "REGULAR": "good lead time service\n good product"
 },
 {
  "REGULAR": "Good products and punctual delivery.\n Very long product delivery time.\n We had a problem with a product and the help to solve it was insufficient."
 },
 {
  "REGULAR": "Very slow response, I provide support for technical queries about your product line, it does not go beyond the technical issues that are requested."
 },
 {
  "REGULAR": "Good products, but market organization is weak"
 },
 {
  "REGULAR": "For the sake of people. Behavior of some people in the company."
 },
 {
  "REGULAR": "Basically, more proactive assistance is expected and not reactive to problems."
 },
 {
  "REGULAR": "It has the knowledge, skills and responsibility appropriate to our needs."
 },
 {
  "REGULAR": "Disorganized trade policy in the countryside, a mess.\n In 2017 it was like this, it improved in 2018 and now in 2019 it's complicated, our competitors' channels offering in the field at a price lower than our cost, who explains that to me?\n So today I don't know if I would recommend BASF."
 },
 {
  "REGULAR": "BASF has great products but the service and logistics don't work well"
 },
 {
  "REGULAR": "Yes, due to the quality of the products and the variability of solutions available for different applications."
 },
 {
  "REGULAR": "I understand BASF as a respectable company with great lines, reliable products, a good portfolio is a great level of research, but with confusing low-profit commercial policies, many distributor conflicts (many in the same areas) and very little dialogue with your distributor."
 },
 {
  "REGULAR": "The company has had and has good products, but in my case in particular, stop working with the SUVINIL brand (Basf stopped marketing it in the country), at the time, it caused me at the time a void in that quality of products, since although it was replaced by CASABLANCA, it was not the same, and some time later, once the CASABLANCA products were completed, it also did the same with it. Understandably, it was probably not convenient, but for those of us who sold those products it caused us harm. There were also many personnel changes (at least those who attended me), and there were moments that I had no reference within Basf."
 },
 {
  "REGULAR": "Good predisposition and understanding of the business"
 },
 {
  "REGULAR": "Because of the quality and delivery problems we have had. I think BASF should be well above the performance shown."
 },
 {
  "REGULAR": "In general BASF is an average provider, which does not stand out from the rest"
 },
 {
  "REGULAR": "In the case of automotive dealers, they respect the marketing areas"
 },
 {
  "REGULAR": "Basf is an international company, with a good track record, good customer service.\n I consider the prices high compared to the rest of the market."
 },
 {
  "REGULAR": "Company focused on products with little intimacy with the customer. It has the worst price dispersion between resellers and direct sales in the agricultural market."
 },
 {
  "REGULAR": "In the past, BASF was more our partner. It helped us much more to fight in the market. Now our biggest problem is that we generate demand for BASF products and so often cooperatives are the sellers.\n They are much bigger, sell from all the major brands and have much lower costs to the government.\n In this way, resellers are getting tighter every day.\n In short, we feel that we are continuing to do everything we did for BASF, but the opposite is not being true."
 },
 {
  "REGULAR": "company would be of good principles"
 },
 {
  "REGULAR": "Because when it comes to effectiveness and great quality.\n However, we are concerned about offering and not having the necessary demand for assistance."
 },
 {
  "REGULAR": "The company's portfolio is excellent, with great acceptance in the field, products of extreme quality and that deliver the result. The team is active and accessible. As negative points to justify the grade is the company's delay in launching its campaign in front of the main competitors, where its distributors are harmed in the market and, in addition, the bureaucracy and complexity of the company's processes and campaigns, which makes it difficult to work in the field."
 },
 {
  "REGULAR": "Basf has a good service and a desirable quality, but it does not provide flexibility."
 },
 {
  "REGULAR": "10 in relation to products, but I see that there is opportunity in the service, especially in terms of delivery and accuracy of information related to imported items (changes in terms)."
 },
 {
  "REGULAR": "Due to the large number of historical changes that have been lost, they are being resumed."
 },
 {
  "REGULAR": "At times there is a lack of products of interest to us and at other times, price increases well above the competitors found in the market, this led us to direct purchases to other suppliers and to learn how to handle products other than those we use from BASF, eg . the PIRAT."
 },
 {
  "REGULAR": "I don't know the level of being a friend or colleague, but within the company, BASF is the only company that is working on it, and we continue to communicate that it has an advantage in terms of quality through Q & D. Outside the company, SAP performance simple experiments are open to the public at exhibitions."
 },
 {
  "REGULAR": "Delays in the processes."
 },
 {
  "REGULAR": "Due to lack of knowledge and use of the products offered by Basf"
 },
 {
  "REGULAR": "Basf is an excellent company, but it has low flexibility in lead-time, prices, etc."
 },
 {
  "REGULAR": "We had many problems related to the maintenance of quality in the supply of PSA adhesives, ( Acronal 476 ), and delays in responding and solving the problems presented, generating unnecessary wear between customer-supplier."
 },
 {
  "REGULAR": "Delay in sending samples"
 },
 {
  "REGULAR": "lack personal contact"
 },
 {
  "REGULAR": "BASF is extremely efficient when it comes to creating molecules\/products. However, it has a very rigid commercial policy, in addition to not being the most efficient in logistics."
 },
 {
  "REGULAR": "High prices and slow service."
 },
 {
  "REGULAR": "We have been having problems with the supply of the company's products, which is demanding a lot of effort from both parties to ensure that there is no lack of product at the plant with the risk of line stoppage."
 },
 {
  "REGULAR": "Contacting our local support is extremely difficult where I believe that BASF Brasil has a low perspective in relation to PLIB."
 },
 {
  "REGULAR": "Basf's products are good in their application, but the delivery time and the constant unavailability make us rethink about recommending the product."
 },
 {
  "REGULAR": "Many recent problems with lead time delays for acquisitions"
 },
 {
  "REGULAR": "Services still below expectations for a recognized multinational company."
 },
 {
  "REGULAR": "Some raw materials are causing problems in the final products."
 },
 {
  "REGULAR": "Prices practiced by Basf is uncompetitive against its competitors."
 },
 {
  "REGULAR": "Commitment to the customer"
 },
 {
  "REGULAR": "Wide diversified event that contributes to networking, negative points, many presentations and little time for questions and answers for the items covered"
 },
 {
  "REGULAR": "Excellent service but we had serious problems with supplies issues."
 },
 {
  "REGULAR": "Very high quality products, but at the service level it is very bad and, even with countless feedbacks, there is no improvement. The impression is that the head office in Germany does not pay attention to the complaints that Brazil points out or that these complaints do not reach there for the necessary actions and improvement in the quality of service. The company loses a lot of sales to competitors that offer substitute products with prices and, above all, a much higher level of service. Sds"
 },
 {
  "REGULAR": "There are many people in different businesses. They should centralize in one person when they have several businesses in the same company. Also, they practice extremely high prices."
 },
 {
  "REGULAR": "They are always available with products in addition to assistance with dispatching the material, without bureaucracy."
 },
 {
  "REGULAR": "I recommend it for being a power and important company in the market, but a very bureaucratic company with many hierarchies. No openness\/freedom for decision making."
 },
 {
  "REGULAR": "Despite having high technical capacity in its products, I understand that it needs to improve in terms of technical assistance, in our case a low rate of innovation proposals and improvements in applications."
 },
 {
  "REGULAR": "Lack of technical assistance"
 },
 {
  "REGULAR": "Sudden changes in the condition of products with slow communication."
 },
 {
  "REGULAR": "I like the company's products, the support of the technical staff, but I think there is only a lack of more open communication regarding the changes that may occur along the way with regard to raw materials."
 },
 {
  "REGULAR": "Little flexibility in negotiations."
 },
 {
  "REGULAR": "7 for considering the technical part of BASF, but if we take into account the management of the BASF group, mainly the coating area, the score would be much lower."
 },
 {
  "REGULAR": "Validity of items we receive, from time to time quality problems and delay in certain important points"
 },
 {
  "REGULAR": "Basf is a technologically important Global Company and needs to increase contacts with Clients, to be closer."
 },
 {
  "REGULAR": "Although the quality of BASF products is undeniable, and the support offered by the local team (quality and commercial) is satisfactory, I suggest some changes in terms of the company's posture regarding requests linked to national product quality laws.\n Since it has a considerable market in Brazil, it is necessary to adapt to Brazilian legislation, meeting the requirements of ANVISA (or sometimes MAPA) regarding the analyzes and parameters required in the RDCs, IN and the like. I understand that BASF's international production and quality parameter meets, in theory, the requirements of the Brazilian body. However, the lack of \"evidence\" leads the client, many times, to opt for other manufacturers, which provide the information, reports, certificates, methodologies and statements required by these institutions.\n Thanks for the attention,"
 },
 {
  "REGULAR": "Because BASF is a great player, it has many options. It is not ideal because it got too big and some answers never arrive."
 },
 {
  "REGULAR": "Good to excellent products, but some commercial differences."
 },
 {
  "REGULAR": "Product is of quality"
 },
 {
  "REGULAR": "It is very difficult to find the person we have to talk to about a certain raw material."
 },
 {
  "REGULAR": "It is a reputable company that delivers the product with the desired quality"
 },
 {
  "REGULAR": "Basf has excellent products when Exclusive, with the exception of materials used for other applicators, we are lacking due to the low volume we use.\n Technical assistance has great specialists but low visits from them."
 },
 {
  "REGULAR": "A company we can count on, but with some inflexibility."
 },
 {
  "REGULAR": "Many documentation errors and shipping delays. The solution is also slow to occur."
 },
 {
  "REGULAR": "BASF's form of corporate governance prevents its top-level managers from being far from the reality of its clients. The suggestion is that they have in their agenda visits to strategic customers or projects together with customers so that this relationship is closer."
 },
 {
  "REGULAR": "Delay in delivery of products."
 },
 {
  "REGULAR": "High number of resellers competing for the same market ... Low margin,\n Little control over peak price,\n Marketing on carries cost of products that start to gain market and this leaves product without competitive power."
 },
 {
  "REGULAR": "RTV Support"
 },
 {
  "REGULAR": "No specific reason. I consider the note appropriate."
 },
 {
  "REGULAR": "BASF is giant, and I don't know what BASF we're talking about. There are divisions that have restrictions, and others that I admire. Hence my average rating."
 },
 {
  "REGULAR": "The service is satisfactory."
 },
 {
  "REGULAR": "The company provides a good service within the normal perspectives. However, we have difficulty competing with other BASF distributors, many non-branded resellers sell products at more competitive prices than ours and it seems to be a problem that will not be solved soon."
 },
 {
  "REGULAR": "Supplier that offers quality products."
 },
 {
  "REGULAR": "The company has an excellent portfolio and structure, however it lacks in distribution policy."
 },
 {
  "REGULAR": "FOR THE QUALITY OF THE PRODUCTS"
 },
 {
  "REGULAR": "It used to be a great supplier, but with the changes in recent years, it left something to be desired"
 },
 {
  "REGULAR": "Our work with BASF is recent, we can see the seriousness in the processes, trained professionals and a simple sales process.\n Having a strong point of improvement in relation to the supply of strategic products that are never available to meet the market."
 },
 {
  "REGULAR": "Variation in product quality"
 },
 {
  "REGULAR": "Meets us within the standard. The point to improve and the question of collaboration between companies and internal bureaucracy, often taking a long time to get answers."
 },
 {
  "REGULAR": "The lack of products at BASF is frequent and lasts for at least three years. The information arrives late and on the wrong \"team\", even informing the purchase plan far in advance.\n\n The portfolio is good, with great products, but there is no availability and the shortage of professionals makes it difficult to sell."
 },
 {
  "REGULAR": "Basf's service quality has dropped a lot lately. This is the main reason."
 },
 {
  "REGULAR": "Differentiated between global locations, we are trying to level differences."
 },
 {
  "REGULAR": "The quality of the products is exceptional, but the commercial service, price and flexibility leave something to be desired."
 },
 {
  "REGULAR": "Quality products, committed staff and quick turnaround.\n Fleet used for material deliveries needs to undergo improvements."
 },
 {
  "REGULAR": "Variation in the quality of service when changing the contact professional. Little flexibility in certain themes, slow in some answers. Quality problems are few, but when they exist they take a long time to be solved. For existing products, competition offers almost the entire package at a lower cost (internalized imported < BASF site), with flawless logistics and without any quality problems."
 },
 {
  "REGULAR": "We had a very serious problem with the quality of his material that practically made Canopus lose his business in Ecuador."
 },
 {
  "REGULAR": "It depends on the size of the company to whom I will recommend."
 },
 {
  "REGULAR": "One of the main problems I see is in relation to the difficulty in communication, sometimes we send some requests and the return is too long or we often have to call to have this return. With regard to calls, we have another problem, as we often have difficulties talking to the Analysts responsible for our portfolios and we need to call several times until we are answered. Other than that, we have no problems with care, but sinning in communication is something that weighs heavily in the analysis."
 },
 {
  "REGULAR": "Excellent products, but the systems reliability is very low... which causes a lot of risk exposure."
 },
 {
  "REGULAR": "Improve the speed of technical assistance."
 },
 {
  "REGULAR": "The question is lacking in detail... to recommend in what sense? Supplier \/ Customer \/ To work?\n As a supplier I consider it good, but there are many opportunities to improve the consistency of the quality of its products and technical assistance."
 },
 {
  "REGULAR": "The quality of BASF products"
 },
 {
  "REGULAR": "5 for the only serious reason we had recently with BASF. We had a quality problem with low density and curing of the Polyol material where we had two lots contaminated in our process, which ended up in the assembly line. Basf supported us technically very well Mr Tadeu followed the online tests and confirmed the origin of the problem, however Basf left something to be desired in the dynamics of replacement responses with Donaldson. It was an extremely stressful process because I didn't feel the commitment to solve the problem in restocking the new batch.\n Several obstacles were created for the customer as the BASF system is completely plastered for this type of customer support.\n Another factor taking into account this same problem is the same BASF department where they need the Invoice to request transport for non-conforming material removal that is taking up space and generating another inconvenience for their customer. In my view, as I had informed the number of drums and the weight, it was only necessary to schedule the removal of the material with your supplier because the NF Donaldson removal process does not take more than 24 hours.\n More critical was the dynamic line-stop support with Donaldson.\n But I would like to emphasize the good technical support work that Tadeu Nicodemus Ribeiro has been doing with Donaldson. Every time we needed his support he was always helpful and punctual with his customer."
 },
 {
  "REGULAR": "Because we need to have more clarity and agility in commercial matters."
 },
 {
  "REGULAR": "Basf is a long-standing partner of ours and we still believe in this story.\n But there are two points that still need to be adjusted:\n *** Effective marketing actions and product launches, aligned with different regional realities.\n *** Profitability from resellers. With increasing spraying, the price of the brand is deteriorating and margins squeezed."
 },
 {
  "REGULAR": "Basf is a very dispersed and low-margin supplier. The distributor sells to anyone and at prices without much difference with whom, it buys directly from Basf."
 },
 {
  "REGULAR": "HIGH QUALITY PRODUCTS."
 },
 {
  "REGULAR": "excellent product, but prices are above competitors"
 },
 {
  "REGULAR": "Product, partnership, relationship"
 },
 {
  "REGULAR": "Need to present better prices for catalysts."
 },
 {
  "REGULAR": "Regarding the import operation, we have some open points that have already been discussed at the meeting, some resolved, others not, and when we ask BASF to officially be responsible for costs in case of deviations in the import process, they do not do it.\n They come back with the need to schedule a new meeting.\n\n This causes delay and waste of time for my import team."
 },
 {
  "REGULAR": "Good supplier, however, although some materials do not have negotiation\/supply flexibility"
 },
 {
  "REGULAR": "Delay in the feedback team, difficulty in obtaining samples, high cost."
 },
 {
  "REGULAR": "a little delay in answering the phones"
 }
]