[
 {
  "ruim": "There is no flexibility, too many products that customers must adapt and not BASF developing to meet customer needs."
 },
 {
  "ruim": "Low availability of products for new businesses in the Brazilian market."
 },
 {
  "ruim": "In 2020, we had a very unkind situation with BASF. We closed some DMAPA orders, which were confirmed to have been met. About the date of shipment, BASF announced that it would be canceling all orders from Croda, bringing a very negative impact to our process and consequently to our customers. That is, without any empathy for the customer, BASF decided to cancel all orders for South America so that it could meet the existing demands from the United States and unexpected demands from Europe, we tried to talk to the responsible Manager to help us with the partial service. volume to minimize the negative impacts that would exist, but nothing was done. I also didn't get any Global channels of complaint for BASF's misconduct. From then on we stopped buying this item from BASF. It was one of the most regrettable situations we experienced with this organization."
 },
 {
  "ruim": "We don't get attention from our broker and the prices they give us are the same as those on the market and that way you can't work just serve the big chains and keep in mind that we sell a lot of automotive paint if not look at the free market"
 },
 {
  "ruim": "The value of the product we bought more than 15 years ago is rising far above the competition"
 },
 {
  "ruim": "I do not have a valid BASF interlocutor to attend to my concerns, commercial issues, response to emails, calls, etc.\n\n I write, I call and I have no answers of any kind to the topics. They completely ignore me."
 },
 {
  "ruim": "BASF Chile, which is my supplier, does not provide clear or timely responses to my needs.\n Decisions are slow, and to the extent that I insist on communicating with a valid interlocutor, they do not answer my phone or emails.\n In short, resolution management is lousy."
 },
 {
  "ruim": "No comment"
 },
 {
  "ruim": "Company with little transparency of internal processes, delays deliveries in order to achieve billing goals and not in customer need!"
 },
 {
  "ruim": "Product stock problems, little product mix for the area"
 },
 {
  "ruim": "Not strictly complying with what was closed, and coming later to say that there will be a lack of products.\n Change of Management placing those who do not live the day to day of Bom Futuro Agricola and failing to give opportunity to those who are already in our day to day."
 },
 {
  "ruim": "Very poor quality of the products, the technical attention does not provide the level of response expected for a company in the hierarchy of Basf, and when they request deviations committing to assume the costs, then they do not want to recognize them."
 },
 {
  "ruim": "Lack of ethics of superiors ......."
 },
 {
  "ruim": "Difficulty in communication, delivery delays and too many commercial discussions for non-aligned items."
 },
 {
  "ruim": "Bad organization and logistics"
 },
 {
  "ruim": "does not fulfill the agreement\n Orders placed are not fulfilled"
 },
 {
  "ruim": "They lost the quality of relationships with those who actually sell their products."
 },
 {
  "ruim": "good morning, the reason is simple, we made a sale to a client and the tone was different in april a call with basf has already been over 60 days and nothing has been resolved every week asks me for one more thing i already sent a photo, copy of nf photo of the production and until yesterday they didn't give me a position occurrence 210920-000164"
 },
 {
  "ruim": "very expensive prices for the terrible service they offer"
 },
 {
  "ruim": "They have left me without raw materials."
 },
 {
  "ruim": "They are not flexible in the event of emergencies, they do not have good response capacity, there is no customer support."
 },
 {
  "ruim": "They have had product shortages for more than a year. They quote and then they don't have material to deliver, it seems like a joke ... Not very serious. The score is 4 for the quality of the products, otherwise it would be 0."
 },
 {
  "ruim": "We were partners for 03 years and at the moment we needed it most, BASF stopped supplying 100%. Left our factory idle for 30 days and was responsible for a 40% reduction in our billing in the last 12 months."
 },
 {
  "ruim": "Today Suvinil is the most expensive paint on the market.\n The products are never ready for delivery.\n The least profitable ink.\n Competitors sell cheaper than buying from the factory itself.\n One-sided sales policy.\n The most aggressive brand on the market.\n We had a 25-year job, and simply, we were excluded by the pricing policy.\n It has a discriminatory policy in the delivery of its products, whoever is SELF, has preference to receive the products."
 },
 {
  "ruim": "Highly competitive products, but strong candidates with equal quality at lower cost."
 },
 {
  "ruim": "He doesn't care about the client in Brazil. It closes the market for South America when profit is higher in America."
 },
 {
  "ruim": "BASF favors distribution more than a direct customer. It's getting more and more complicated to work."
 },
 {
  "ruim": "The products are very good, however there is a long delay in quotes."
 },
 {
  "ruim": "Product availability has been a problem for more than 1 year, we have not managed to have a stable commercial relationship over time"
 },
 {
  "ruim": "they do not have product generally"
 },
 {
  "ruim": "UNFORTUNATELY THEY DO NOT MEET THE SHIPPING DEADLINES - DELAYS OF MORE THAN 120 \/ 180 DAYS.-"
 },
 {
  "ruim": "There are no doubts about the quality of the products and technical knowledge of the referents, but logistics and times are always a great inconvenience."
 },
 {
  "ruim": "Long delay in responding to a query"
 },
 {
  "ruim": "Non-compliance with deliveries due to lack of product"
 },
 {
  "ruim": "We have problems with many purchase orders placed."
 },
 {
  "ruim": "- Bad problem solving\n - Lack of clarity and transparency of information\n - Constant shortages of products"
 },
 {
  "ruim": "Due to the non-compliance with the negotiation agreements carried out in the acquisition of seed for the 2019\/20 crop."
 },
 {
  "ruim": "Lack of better presence in operations and management model needs to be defined together to obtain better results. Today is very reactive"
 },
 {
  "ruim": "Incoherent commercial conditions and poor product availability."
 },
 {
  "ruim": "Good morning,\n\n We buy and import from BASF and run out of products.\n\n Fernando"
 },
 {
  "ruim": "It takes time to confirm some volumes\/products.\n Shortages\n Price above market."
 },
 {
  "ruim": "Problems reaching requested dates and inventory not available"
 },
 {
  "ruim": "Because they are very slow to respond and make decisions and they rarely fulfill commercial promises."
 },
 {
  "ruim": "The commercial policy applied has been a disaster in our market, the new marketer has come out to destroy the margins, currently doing business below our cost."
 },
 {
  "ruim": "In recent times, BASF is not protecting marketers, measures are taken that only benefit BASF and in a commercial relationship, mutual benefit is important."
 },
 {
  "ruim": "It is a company that wants to apply the rules of the first world and does not realize that it is in Argentina, apart as a client that I was always I had the feeling that they are not interested in the least."
 },
 {
  "ruim": "From August-2020 to the present, BASF has not fulfilled the deliveries of the emulsions in a timely manner. For an industrial company, the fulfillment of the supply, and the trust in its suppliers, is a fundamental requirement to be able to operate (and more in key materials such as emulsions), since if it does not directly affect our production, and therefore to our clients."
 },
 {
  "ruim": "The bad communication with the Representatives and the feedback of the orders placed with BASF that do not respond is consequent, it is necessary to be sending emails."
 },
 {
  "ruim": "Actually, although we started a very good relationship with BASF, communication has become very difficult, we understand what is happening worldwide, but it takes weeks to respond to emails, to give quotes or sometimes they simply never answer"
 },
 {
  "ruim": "You don't have the same quality of service anymore. It was once a company that was proud to be a partner."
 },
 {
  "ruim": "Good morning, in relation to the current scenario, Basf has prices that do not match the market."
 },
 {
  "ruim": "At this moment, BASF deliveries are the worst, with delays and delivery problems."
 },
 {
  "ruim": "Price wars between distributors make the profitability of the line very unprofitable. They seem to be concerned only with the short term. They have value-added products but they market them as if they were generics and the margins end up being generic. They do not have a sufficient presence in the field and are not in a position to compensate with the presence of committed distributors because who wants to commit to a company that is not profitable?"
 },
 {
  "ruim": "Lack of empathy for the customer"
 },
 {
  "ruim": "I was a great driver of BASF within my company, improving the control works of Sphenophorus levis and BASF did not support me in the development of the quality of the application technologies in rigs, where I use her product. other than that, I have no support in the development of other BASF technologies that I consider differentiated in the market, such as foliar fungicides and azospirilum.\n\n There is a lot of share space for BASF that is not explored here due to a lack of monitoring and technical development,"
 },
 {
  "ruim": "Lately I have a lot of problems with the Suvinil brand, I am a customer who has been buying materials in large volumes for over 22 years.\n To describe all that I have of dissatisfaction would spend a lot of time and maybe not use this channel.\n\n I am available for a meeting\n"
 },
 {
  "ruim": "BASF does not listen to the arguments of distributors, RTVs and managers have no autonomy for anything, it is inflexible in negotiations and practices enormous price dispersion between distributors and direct sales."
 },
 {
  "ruim": "Attention and very late response on important matters."
 },
 {
  "ruim": "Little support, very distant.\n Non-competitive prices."
 },
 {
  "ruim": "Very long lead time for supply, unreliable in fulfilling orders in a timely manner. Lack of communication"
 },
 {
  "ruim": "Delivery times are disastrous !!"
 },
 {
  "ruim": "Today the chemical business in general in terms of street margins are very bad. In the end, the farmer is the one who sets the price for the product. and it does not deliver any added value to the margin. and few people value the advice or the agronomic value. so there is no need to recommend products indistinctly by the brand."
 },
 {
  "ruim": "So that they are not future competition"
 },
 {
  "ruim": "Deliveries never deliver on the requested dates, and they don't keep their own promises. And when there is a quality problem the delay to solve it takes weeks."
 },
 {
  "ruim": "We have noticed that the level of service is not required.\n Delivery follow-ups are low and claims are high"
 },
 {
  "ruim": "Company totally uninterested in the growth or in the transparency and variables of its clientele. Knowing the client's reality, the reality of their intentions and planning.\n A company that because of the information I absorb in the market. It denotes its customers and certain arrogance and is totally segmented and that it will hardly be an integrated company, no matter how good its system and how better its professionals are, as this is a matter of business administrative vision.\n Your decisions are very selfish and self-centered always based 100% on your own navel. And your customers hour interesting disposable hour.\n I believe there are few competitors, maybe that's why the strategy,\n Any competing initiative to compete in the same market, at this point you would lose the negotiation.\n big hug."
 },
 {
  "ruim": "Lack of problem solving."
 },
 {
  "ruim": "We are aware of the lack of raw materials in the world, but BASF has stopped supplying our factory and we are currently out of options and at risk of ending operations after 20 years of work."
 },
 {
  "ruim": "poor management of the sales and supplies team. the customer has to adapt to the basf policy and not the other way around. in relation to the distributor, we expect a partnership, but this is definitely not what happens on a daily basis."
 },
 {
  "ruim": "I have been working with Suvinil for 25 years, today it is the worst company on my list of suppliers!!\n It imposes a unilateral negotiation, where the customer is totally dissatisfied, has the lowest profitability, never has ready delivery products, you oblige you to have a gigantic stock.\n The suvinil today, thinks it can do anything, BUT, it forgot that its customers need to be heard, and there is no BRAND, which can keep itself in the market with such a totalitarian policy!!!"
 },
 {
  "ruim": "many changes in sales staff"
 },
 {
  "ruim": "Great difficulty for the supplier in making commercial technical agreements for the release of prototypes, with a continuous need for monitoring in the escalation process so that the client can have parts for internal tests\n Difficulty of the supplier in following up the project, with delay in important deliveries such as PPAP, bringing strong risks to the launch of the project at the client"
 },
 {
  "ruim": "They stopped meeting our requirements for more than 6 months! That makes us think that the limited availability of product worldwide was delivered to its large customers and the small ones have left us aside."
 },
 {
  "ruim": "The communication channel is distant and reactive to delivery inquiries"
 },
 {
  "ruim": "The communication has not been timely, nor reliable, they make changes without being informed in time to take action.\n Lately attention has deteriorated, very poor communication and the responses requested."
 },
 {
  "ruim": "The portfolio is little solution for the farmer"
 },
 {
  "ruim": "The AGREGA Program is horrible. And nobody at BASF listens to us for changes. We don't get the attention it deserves. Only field personnel are attentive and helpful, but they do not have the \"power\" to change."
 },
 {
  "ruim": "More present support is lacking."
 },
 {
  "ruim": "Today I would not recommend BASF because of the supply problems they present. We are also not satisfied with the speed to solve the problems that arose."
 },
 {
  "ruim": "They could improve the times of imports of their products. I have nothing to say about customer service, always excellent."
 },
 {
  "ruim": "Because there is no coordination with the seller and the consumer."
 },
 {
  "ruim": "Despite having first-rate products, almost unable to bring any problems to the user, Basf brings to the market harmful commercial policies, which destroy value of the entire chain and which comes against the market"
 },
 {
  "ruim": "Tecun El Salvador we have received a bad service since there is no art attention from BASF, there have been changes and we were never notified, we made purchases and we realized that the products were already shared with another distributor and the worst thing is that the permit expired to import and only the new distributor was notified and Tecun was not informed and it could not be imported, the representatives are called and they do not answer and solve the problems and are giving negative Tecun qualifications."
 },
 {
  "ruim": "Our company has been a client of BASF for more than 10 years, in that decade we have dedicated a very considerable amount of human and financial resources to develop many products. Suddenly all that effort vanishes due to the \"OPENING OF BUSINESS\".\n\n The low margins with which we have been compelled to work with BASF products do not make their commercialization sustainable.\n\n BASF has dedicated itself to overstocking our warehouses no matter how deadly that practice is to the financial health of our organization."
 },
 {
  "ruim": "Because our experience with BASF has been unfavorable in many business respects. Eg. They make us sales and sales proposals without thinking about our business if not only thinking about BASF and for it to be a business, both parties must win."
 },
 {
  "ruim": "Very bad communication,"
 },
 {
  "ruim": "because they do not deliver the supplies with the requested useful life conditions, even sending purchase orders one year in advance.\n because before emergencies they cannot respond in an agile and fast way."
 },
 {
  "ruim": "Their products are Excellent but the attention is TERRIBLE, we are numbers.\n After 16 years of experience with BASF I only stay with their products, the rest why there is much more to say is unnecessary, you know more than I can personally describe, and just to take into account my name is Leonardo GAZZIA. Cordial greeting"
 },
 {
  "ruim": "Service a disaster"
 },
 {
  "ruim": "The bureaucracy that the company has means that we cannot access all the knowledge and products worldwide, each request takes too long to be answered and many times it is not answered at all. There is very little flexibility in care."
 },
 {
  "ruim": "Basf sells to a distributor in my city, so they don't sell me a polyol, tdi, copolymer !!!\n\n I work today importing directly and buying covestro, my consumption today is 100 tons of polyol, 75 tons of tdi, 9 tons of copolymer month ... payment method 14 days.\n\n I hope that after that answer, someone from Basf can see this situation because I always looked for you so that I could have Basf as a supplier too. But Mr. Sérgio and Mr. Rafael never gave me the opportunity!\n\n Thank you for doing the research and letting me out."
 },
 {
  "ruim": "It depends on the size of the colleague's company, if it is a small company they will not serve it"
 },
 {
  "ruim": "We have been giving Basf a 6-month forcast service and there have been frequent delays in the delivery of Lauril Pasta."
 },
 {
  "ruim": "Low level of service and customer care, very long waiting times."
 },
 {
  "ruim": "We were not very supported by the pandemic and there was a disproportionate price increase"
 },
 {
  "ruim": "Basf does not respond to the requests and recommendations for improvement of the CoA, we already know that it is a global coA, but the minimum GMP deliverables (city of the manufacturing site, useful life and expiration date) should always be included."
 },
 {
  "ruim": "THERE IS NO ATTENTION OR SUPPORT, NO UPDATES, NO TECHNICAL VISITS, NOT EVEN PHONE CALLS, WE ARE WORKING WITHOUT SAMPLES, SPECTRUM WITHOUT BATTERY SPARE PARTS ....."
 },
 {
  "ruim": "Because they don't get involved in the problem"
 },
 {
  "ruim": "It is a company where profitability levels ceased to exist, although I as an advisor recommend the products, the advised producer always finds the cheapest products."
 },
 {
  "ruim": "I never got the interview and I would have liked to rate my salesperson, his attention is terrible"
 },
 {
  "ruim": "Improve customer contact."
 },
 {
  "ruim": "LOYALTY, COLLABORATION, SUPPORT"
 },
 {
  "ruim": "My answer is with the look of a dealer's land seller, this is due to the lack of trust and transparency with zonal with respect to the businesses of certain clients."
 },
 {
  "ruim": "Because the prices that the competition has in their products that sell everything at least 20 to 25% negative margin, they have no incentive to recommend Basf products, being of good quality, but it is the reality that we have in Los Angeles"
 },
 {
  "ruim": "Because these problems have already been reported numerous times for everyone who questions us. Unfortunately, we have not seen any favorable position for improvement."
 },
 {
  "ruim": "For the above reason, commercial policy is very bad, as there is no price control work at the end, no one actually manages it at the end. Save yourself whoever you can."
 },
 {
  "ruim": "Lack of response, delivery of delayed documentation, status of the cargo in a timely manner"
 },
 {
  "ruim": "WE DON'T HAVE A SERVICE SUPPORT, ALWAYS IN OUR REGION WE ARE ABANDONED, EVERY TIME WE ARE IN THE Q WE WERE WITHOUT A CONSULTANT, I THINK THERE SHOULD HAVE A GREATER SUPPORT, WHENEVER WE HAVE ANY PROJECT IN PROGRESS WE HAVE TO STOP AND START ZERO DATE AGAIN, GIVING SPACE FOR OTHER BRANDS TO ENTER THE MARKET."
 },
 {
  "ruim": "I don't see BASF close to its customers"
 },
 {
  "ruim": "Unfortunately we no longer do business with Basf , we consume their products through AD and PG distributors , IMCD .\n We feel neglected by BASF when informing that we would have to have a minimum consumption of\n 400 thousand Euros per year"
 },
 {
  "ruim": "sloppy customer service"
 },
 {
  "ruim": "BASF is a very good supplier, but due to its complex and sometimes authoritarian internal policies, they do not encourage corporations to expand the portfolio in Scandinavia Pharma purchases, one of the reasons for not having it within commercial allies is the refusal to expand payment term taking into account the volume of purchases that we have with BASF."
 },
 {
  "ruim": "Very confusing company."
 },
 {
  "ruim": "The logistics area is very deficient; There are no products, they dispatch incomplete POs, they do not provide information in real time."
 },
 {
  "ruim": "Due to the new commercial policy that favors a large national group, which has an exclusive discount rate in the ello category."
 },
 {
  "ruim": "1. From my perspective, unfair trade policy:\n a) Small BASF store with reduced portfolio buying 6% cheaper through the Mundial distributor (campaigns buy 10 cans and get 1);\n b) New entrant (MC Paints) buying up to 14% cheaper;\n\n * Consequently, 2019 was the year in which we granted the largest discount on Suvinil products, causing a drop in margin and the need to recover this loss of profitability in other suppliers.\n\n c) 90-day interest-free period for the competitor;\n d) Sales in the old table 30 days after the table was turned over with the competitor's justification for not having a DC (Distribution Center). Inconsistency because whoever invests in the business (who has CD) is penalized.\n e) Weakening of the ELO program. Lack of transparency or perception of management policy in sight.\n f) Commercial and strategic proposal less attractive than other suppliers in the segment.\n\n 2. There is a need for better training of the sales team\n a) When questioning the price difference that the competitor practices in selling to the consumer, the answer is another question: \"Do you know the volume that MC buys nationwide?\". There is inconsistency because obviously the participation of the new entrant in GO is smaller. And regional players do not compete in other markets (such as SP);\n b) There is no gratitude when the goals are reached, but there is a very aggressive and hostile demand when they are not; A real connection between sell in and sell out is missing. If you don't sell due to unfair commercial policy, it's no use charging sell in.\n c) The team lacks the value of simplicity.\n\n 3. There is a lack of better training for the merchandising team\n a) Merchandising promoter rated all stores in the chain with a star on Google;\n b) Lack of professionalism with excessive proximity (case manager Rosimeire \/ Castelo Branco store: \"Good morning, brunette \/ beautiful marvelous\");\n c) Rudeness in the reopening of the T-63 store when using a product with the label of Melotintas' biggest competitor (Unitintas) in the application of products to a large number of final consumers and painters.\n d) Very low involvement in the reopening of the store: Arrived late, all wet\/sweaty, did not do the texture and color plates (texture and color palette); On the eve, we hired a painter to make the Marble and Touch of Glitter apps.\n e) No involvement in the new store (Castelo Branco).\n\n 4. From a strategic point of view:\n a) Conflict with the Distribution channel lasts for more than 5 years: Channel that has no success cases in the segment in the region of Goiânia. There are several cases of failure both with Suvinil products (Luma, Mécari, Mundial) and with other brands (3M, Renner, etc.); On average, the business barely reached 5 years.\n b) Low historical knowledge in the region: Common characteristic of those who were leaders in the region (Coral, Suvinil, Leinertex): all without the distribution channel, buying with a transparent and coherent policy."
 },
 {
  "ruim": "BASF is an excellent company to work for, but as a supplier it leaves a lot to be desired in terms of delivery and service information."
 },
 {
  "ruim": "In the region in which I am part of agribusiness, we have pricing very different from Direct Sales, with these pricing it is increasingly difficult for distribution to play the important role of services and capillarity in the area. We need a more industry-adjusted final fallout."
 },
 {
  "ruim": "A company with excellent products, however, has not served well in terms of deliveries, that is, in agriculture, the timing is definitive for the success of hits or misses.."
 },
 {
  "ruim": "Low price competitiveness"
 },
 {
  "ruim": "Lack of product, support and price"
 },
 {
  "ruim": "For the simple reason that Basf is now one of our competitors, selling to construction companies, condominiums, among others.\n We resellers cannot compete directly with the industry, thus making an unequal fight.\n So there is no way to refer a friend or colleague, it would be easier to refer to a competitor."
 },
 {
  "ruim": "Good afternoon, I was an exclusive partner, for many years, but for 4 years now, it has been very complicated to compete with customers served by distribution, we as ink cartridges need to maintain various services such as: fast delivery, training for painters, paint and stock consultants of all items and volume. Today the profit margin is very low."
 },
 {
  "ruim": "A company that has great growth potential due to the quality of its products, unfortunately the management is not the best."
 },
 {
  "ruim": "We work with many BASF products and the truth is that it is complicated since you have to talk with each sector corresponding to your product and also the difficulty for them to sell us some products"
 },
 {
  "ruim": "Bad service"
 },
 {
  "ruim": "They have depleted the Ibuprofen market without giving any explanation and permanently delaying deliveries. On the other hand, after returning to production, they reported a price increase."
 },
 {
  "ruim": "Ibuprofen market shortage on several occasions over two years, little transparent information in this regard."
 },
 {
  "ruim": "As they are commodity products, they do not have a competitive price"
 },
 {
  "ruim": "AT THE TIME IT IS NOT MEETING THE DISTRIBUTOR'S EXPECTATIONS VERY LOW TIP PRICES"
 },
 {
  "ruim": "Delivery of Expired Material, non-compliance with Delivery Dates."
 },
 {
  "ruim": "Good variety of products globally and very poor quality in Argentina"
 },
 {
  "ruim": "Lack of product, difficult delivery, non-fulfillment of promises."
 },
 {
  "ruim": "He has been let down many times by trusting"
 },
 {
  "ruim": "The Company strives to make the sale claiming that the product will rise due to the exchange rate. I buy, the exchange rate takes off (3.79 -> 4.15) and the product falls in price in R $. I should have thought it was good, because the input fell and I'm a producer, but I remember the conversation and arguments at the time of the sale and I reflect for the future .........."
 },
 {
  "ruim": "Today we have Basf supply a very low spend item, which we were unable to pass on to a distributor due to exclusive contracts Basf has with distributors. In addition, as we have to continue with the BASF supply, there is an incredible delay for the simple signing of a contractual term - not a legal contract, but a simple contractual term."
 },
 {
  "ruim": "It is increasingly difficult to work with BASF. The difference in pricing between resale and direct sales is very large. This affects our market a lot. Any small customer in the region buys at the levels we buy or even better. Product migrates from other locations to our region due to price differences and we are \"thieves\" here. They talk so much about adding value, but VD is only price."
 },
 {
  "ruim": "Communication is only made with the Board of Companies.\n They don't pay attention to the people who actually sell their products."
 },
 {
  "ruim": "THERE IS NO TECHNICAL SUPPORT IN THE AREA"
 },
 {
  "ruim": "Your portfolio is very good, your people do not build trust in the long term."
 },
 {
  "ruim": "Very poor after-sales service and resolution of quality problems"
 },
 {
  "ruim": "commercial negotiation"
 },
 {
  "ruim": "In my opinion, they don't care about the customer. They don't give you a chance to listen to the client's side. I don't have anything to complain about my consultant, but the only channel I have for any complaints is him, and I realize that he is limited to many actions. It seems that there is a sales policy, but it is not followed. We are tired of seeing resellers selling at very low prices, prices that it is impossible to keep up with. My score is 4 because the company has good, quality products, a product that I do want to have in my store and that I do want to sell. But unfortunately, the negotiation, the ways in which the goals are imposed, without any concern for the customer's needs, has generated a great deal of dissatisfaction in relation to Basf. A relationship that should be a partnership I cannot visualize. On the contrary, unfortunately the feeling I have is that I have a supplier that plays against us."
 },
 {
  "ruim": "The products are excellent, brand consolidated. But a lot of negotiation difficulty (currently). With unrealistic goals and there is no revision of those goals. Due to the discount policy, even working with a margin below the minimum, smaller resellers are out of the market. Does not provide necessary profitability."
 },
 {
  "ruim": "The last year and a half they have not responded as expected. The quality is still there but that is no longer a plus, that is already the average or the minimum that one would expect. They have been failing to fulfill order after order and have left us without material on several occasions with a firm OC more than 4 months in advance."
 },
 {
  "ruim": "1 month ago we closed a direct import operation and it had to be shipped before September 30. 2 weeks ago we made the advance payment and now they inform us that they do not have the full amount required and that we must wait 3 weeks for it to be ready, when they had confirmed that it was immediately available. Therefore, they are not reliable suppliers since we expected to have the material in Argentina by October 29 at the latest and with the new news they gave us, I do not think we can have the merchandise until the end of November."
 },
 {
  "ruim": "There is no respect for distributors"
 },
 {
  "ruim": "The lack of personalized attention, which makes the client feel that it is important"
 },
 {
  "ruim": "Bad attention a lot of bureaucracy"
 },
 {
  "ruim": "Customer Service delivery dates are not reliable."
 },
 {
  "ruim": "Difficulty in solving problems related to the delivery of key product from the management of a plant.\n In the Regent case"
 },
 {
  "ruim": "Basically in my business relationship with this company"
 },
 {
  "ruim": "Little personalized attention, slow responses,"
 },
 {
  "ruim": "I would not recommend basf because we were isolated from small distributors, for basf only distributors who do not have a warehouse and handle large scales of products are counted and they have been in charge of damaging the market by giving better prices than those offered by basf to distributors."
 },
 {
  "ruim": "YOUR POLICIES ARE VERY DIFFICULT FOR NEGOTIATIONS"
 },
 {
  "ruim": "are not partners"
 },
 {
  "ruim": "They have too many distributors, the profitability in the sale of their products is very low, the products that already have generics are very expensive compared to the competition and there is still no demand for their new products."
 },
 {
  "ruim": "We have requested advice on products for the paper industry without receiving a response.\n It seems that they only care about the sales volume."
 },
 {
  "ruim": "Customer service is distant, there is no fluid feedback"
 },
 {
  "ruim": "Low product offer and bad service"
 },
 {
  "ruim": "They do not value the work we do as marketers of their products.\n Very little presence of its officials in our company.\n Discriminatory policies in the management of the product portfolio and discounts that favor distributors from other areas so that they penetrate, breaking prices in other markets that are being well served by the marketer in the area."
 },
 {
  "ruim": "As Coagra los angeles we do not have price conditions to compete with MV, so I do not recommend Basf products"
 },
 {
  "ruim": "Very different conditions with our competition"
 },
 {
  "ruim": "Doesn't fulfill its commitments"
 },
 {
  "ruim": "The company does not meet product delivery deadlines and has no pricing policy"
 },
 {
  "ruim": "- The delay in responding to commercial conditions.\n - lack of competitiveness vis-à-vis cooperatives.\n -Blindance of customers who have done the work in the past and this year another channel sold, and on top of that they took away a complete BASF portfolio that took 2 harvests to convince, replacing it with Syngenta (BELA Agrícola), this was unacceptable.\n I have been working with BASF for 10 years and I am seeing it increasingly cannibalize its customers (resale), this change in territory management forces a creation of each one for you."
 },
 {
  "ruim": "Lack of information on product delivery (Aprinza, Fipronil, etc.)"
 },
 {
  "ruim": "The prices are high. It does not have programs that interact with companies."
 },
 {
  "ruim": "because they have a very bad logistics, even when buying more than 6 months in advance, they cannot deliver the products with the useful life I need"
 },
 {
  "ruim": "Unfortunately, the sending of samples is very slow, there are abstention problems, and the technical responses are very slow."
 },
 {
  "ruim": "There is no quick return on inquiries, or information on the status of orders, copies of documents do not arrive on time and orders are placed differently than indicated, having to request modifications"
 },
 {
  "ruim": "It seems to me a supplier with poor communication, usually the information initially given changes, it does not generate security or confidence when issuing a purchase order and additionally it seems to me that they have no sense of urgency.\n\n Your logistics and planning process is disorganized."
 },
 {
  "ruim": "It is a company with good products ... but it does not align with the competition \"large laboratory strategies\"\n Is getting outdated"
 },
 {
  "ruim": "low presence and no commercial conditions"
 },
 {
  "ruim": "great difficulty with logistics, due to the products billed that take time to be delivered."
 },
 {
  "ruim": "FOR THE DELAY OF THE RESPONSE AND SOLUTION OF THE PROBLEMS THAT HAPPENS FOR GIVING US RETURN."
 },
 {
  "ruim": "It is very difficult to enter into a business relationship. They never visited us and finally told us that they could no longer sell us direct. Our consumptions were increasing so we were surprised by their decision."
 },
 {
  "ruim": "Very little accompaniment to distributors"
 },
 {
  "ruim": "Bad attention, I am waiting for a battery from a spectrophotometer for more than 1 year, they do not visit customers, I do not have color updates, samples, sales tools, a disaster"
 },
 {
  "ruim": "There is no greater variety of products"
 },
 {
  "ruim": "We are a reseller representing BASF agricultural products in URUGUAYANA-RS and currently our area is being invaded with BASF products from other resellers that are not authorized to sell in our area and still selling at a price well below the BASF commercial price list, so totally off in accordance with company policies. We would like to know what actions the company will take with respect to this."
 },
 {
  "ruim": "Communication with the client is not good (flyers or Big do not contribute much). The non-existent seller and technical service leaves much to be desired. Prices completely out of date with respect to the competition."
 },
 {
  "ruim": "I'm still waiting for an answer about the delays this year in bicarbonate"
 },
 {
  "ruim": "It is the qualification that we consider to be consistent."
 },
 {
  "ruim": "lousy, disorganized service, full of errors"
 },
 {
  "ruim": "They do not respect the agreed commercial conditions.\n Abusive rates apply"
 },
 {
  "ruim": "Lack of knowledge of the technical area about the products it imports"
 },
 {
  "ruim": "the lack of interest in the proposed development"
 },
 {
  "ruim": "At the startup of Basf's partnership with Powercoat, there were many problems in the process causing great wear and tear, including the service to Powercoat customers was compromised. Today, the problems have almost all been solved, however, we have high costs for stripping paint devices in general, which creates operational problems. Basf was called in to help us on the topic, but the problem was posed as Powercoat (drag) and we were unable to evolve."
 },
 {
  "ruim": "inadequate pricing policy and no guarantee of supply"
 },
 {
  "ruim": "Customer service does not exist, neglect is explicit, lack of information, etc."
 },
 {
  "ruim": "Failure to deliver on the scheduled date, lack of communication and major losses in our production due to lack of raw materials."
 },
 {
  "ruim": "Weak commercial support. Delay in sending commercial proposals. Commercial proposals sent are not the most competitive as they do not use the best route \/ sourcing. Lack of initiative and resoluteness in problems of supply or availability of materials."
 },
 {
  "ruim": "I had a case where BASF refused to take responsibility for the problem."
 },
 {
  "ruim": "I have not received any returns regarding my requests via email."
 },
 {
  "ruim": "Service, accuracy in sending information"
 },
 {
  "ruim": "Catalyst price has increased a lot and is far above direct competitors. Since BASF does not have any follow-up in Brazil to analyze the conversion in loco, and offer the service of a screening partner, and also provide other equipment for aggregation in the sulfuric acid plants. Indeed, competitors have a bigger package to offer, and price is the most important."
 },
 {
  "ruim": "Little flexibility in negotiations. No opening for progress in new businesses."
 },
 {
  "ruim": "Delay in the return of a development! Low interest in serving customers!"
 },
 {
  "ruim": "Various quality and service issues after the merger are solemn"
 },
 {
  "ruim": "Products supplied outside the specification range, causing a lot of instability in the process."
 },
 {
  "ruim": "Good Morning!!\n\n Although Basf is our flagship, pricing for the next harvest was unfeasible, and another problem is the lack of product, it's very exhausting to work in this way."
 },
 {
  "ruim": "It never gives economic viability. ends up generating engineering capacity expenditure without application potential"
 },
 {
  "ruim": "It does not present flexibility in negotiations making the business uncompetitive.\n There are no improvements or cost reduction activities.\n He has no interest in seeking alternatives to make the business more competitive.\n Although we are developing a new product globally, we are not interested in following the same supplier to Brazil."
 },
 {
  "ruim": "Due to recent problems with the supply of Joncryl 2090."
 },
 {
  "ruim": "Support and monitoring of product performance leaves a little to be desired"
 },
 {
  "ruim": "Very bad technical assistance.\n\n Every time we need it, it creates a lot of difficulties\n to see what is already obvious in the end.\n\n I say this as a commercial manager."
 },
 {
  "ruim": "The response time for basic questions is slow, there is no flexibility to adjust the processes, we have a lot of difficulty in phone contact (in my specific case, I was never able to reach my contacts on the phone) this makes the number of emails and noise in communication increases drastically."
 }
]